# Assignment: Machine Learning

### Topic: Python Learning

**Due Date:** 27-03-2025

---

## Instructions:

1. This assignment is focused on exploring and practicing Python fundamentals.
2. Please ensure you follow best practices for coding and commenting and add atleast 2 examples of each concepts (make changes in the existing examples as well).
3. Submit your Jupyter notebook with all code cells executed and outputs clearly visible.
4. Your code should handle exceptions and errors gracefully.
5. Ensure proper formatting of the notebook using Markdown for explanations and code cells for Python code.
6. Use this ipynb file and extend it by adding new examples.

## Guidelines:

- Use appropriate Python libraries such as `numpy`, `pandas`, `matplotlib` where needed.
- Make sure to test your code thoroughly and include examples where necessary.
- The assignment will be graded on:
  - Correctness of code
  - Code readability and commenting
  - Proper use of Python data structures (lists, dictionaries, etc.)
  - Creativity in problem-solving
  - Clarity of markdown explanations

---

## Deliverables:

- Jupyter Notebook (.ipynb) file
- If necessary, any supporting datasets or files

**Note:** Late submissions may incur a penalty, so please manage your time accordingly. Reach out if you have any questions!

<br>

# Table of contents
### 1. Python Introduction
    1.1. Why Python?
    1.2. Where it is used?
    
### 2. Data Types
    2.1 Variables
      2.1.1. Local variable
      2.1.2. Global Variables
      2.1.3. Global keyword
    2.2 Numbers
      2.2.1. Integer
      2.2.2. Floating point
      2.2.3. Complex
    2.3 Strings
      2.3.1. String Length
      2.3.2. String Methods
      2.3.3. Accesing the value of string
      2.3.4. Update the String
      2.3.5. String Special operators
      2.3.6. String Formatting operators
    2.4 Lists
      2.4.1. Create a List
      2.4.2. Access values of List
      2.4.3. Update the List
      2.4.4. Addition in List
      2.4.5. Deletion  Methods in List
      2.4.6. Reverse the List
      2.4.7. List sorting
###### Data types Continue...
    2.5 Dictionaries
      2.5.1. Create a Dictionaries
      2.5.2. Access the value of Dictionary
      2.5.3. UPdate the Dictionary
      2.5.4. Delete the Dictionary (All Methods)
      2.5.5. Length of Dictionary
    2.6 Tuples
      2.6.1. Create a Tuples
      2.6.2. Access the value of Tuples
      2.6.3. UPdate the Tuples
      2.6.4. Delete the Tuples (All Methods)
      2.6.5. Length of Tuple
    2.7 Sets
      2.7.1. Create a Sets
      2.7.2. Access the items of Sets
      2.7.3. Add and Update items in Sets
      2.7.4. Delete the Sets (All Methods)

### 3. Operators
    3.1. Arithmetic Operators
    3.2. Comarison Operators
    3.3. Logical Operators
    3.4. Assignment Operators
### 4. Conditional statements
    4.1. If statement
    4.2. if-else statement
    4.3. if-else-if statement (Elif)


### 5. Loops
    5.1. For loop
    5.2. Break statement
    5.3. Continue statement
    5.4. While loop
    5.5. Nested loops
### 6. Functions
    6.1. Create a Function
    6.2. Calling a Function
    6.3. Parameters in a Function
    6.4. Default parameter in Function
    6.5. Return in Function
### 7. Lambda Functions
    7.1. Syntax of Lambda Function
    7.2. Map()
    7.3. filter()
    7.4. Why, When and where it is used?
### 8. Arrays
    8.1. Create, Access and Update Array
### 9. Class and objects
    9.1. Create class and objects
### 10. File I/O
    10.1. Reading input from keyboard
    10.2.I/O from text file
       10.2.1. Create a text file
       10.2.2. Reading a file
       10.2.3. write into a file
    10.3. File position
    10.4. Why, When and where File I/O is used?
### 11. Pandas Library Introduction
    11.1. Read Dataset using Pandas
    11.2. Why, When and where it is used?
### 12. Series
    12.1. Create a series
    12.2. From ndarray
    12.3. From dict
    12.4. From Scalar Value
    12.5. series is ndarray-like
    12.6. series is dict-like
    12.7. vectorized operations and label alignment with series
    18.8. Why, When and where Series is used?
### 13. Data Frames
    13.1. From dict of series or dicts
    13.2. From dict of ndarrays /lists
    13.3. From a list of dicts
    13.4. From a dict of tuples
    13.5. Alternate constructors
    13.6. Cloumn Selection, Addition, and Deletion
       16.6.1. Column Selection
       16.6.2. Column Deletion
       16.6.3. Column Insertion
    13.7. Indexing/ Seletion
    13.8. Data Allignment and arithmetic
    13.9. Transposing
    13.10 Why, When and where DataFrames is used?
### 14. Veiwing Data
    14.1. Data viewing Methods

## 1. Python Introduction
- Python is powerful HIgh level programming language.In 1991 Guido van Rossum create this language.
* Syntax of python language is very easy.
* Python is a general purpose language.
* It is used for the development of server side web development.
* its object oriented langague
* it is very easy language for very simple and complex applications
* Debugging is very easy in python
* Python is very user friendly language
<br>

### 1.1. Why Python?
* Python operate on multiple platforms like windows, Linux and Mac etc.
* It is more powerful language then other languages, it allows programmers to write programs with fewer lines.
* it is very quick in terms of code execution
<br>

### 1.2. Where it is used?

* It is used in web Applications
* Used to handle Big data
* it is used in complex mathematical systmes
* Used in 3D Applications
* Used in Network programming and different business applications
* Used in Games
* Used in scientific applications
* Used in real time data applications

# 2. Data Types
These are the basic data types in python. These are explained below
## 2.1. Variables
* Variables are just like a containers used for storing data.
* The type of variable is not decleared before use
* In Python, each variable is a object

**_Example 1_**
* The following syntax is used to declare variables

In [1]:
mfloat = 33.33 #variable type is flaot
myint = 33 #variable type is integer
fname = "tahir" #variable type is string

#Print the values stored in variables

print(mfloat)
print(myint)
print(fname)

33.33
33
tahir

In [6]:
## Example 1
height=5.8
age=32
eye_color="Brown"

print(height)
print(age)
print(eye_color)

## Example 2
weight=58
father_name="Miraj khan"
birth_date=12

print(weight)
print(father_name)
print(birth_date)

5.8
32
Brown
58
Miraj khan
12

**_Example 2_**
* Assign values to multiple variables in single line

In [ ]:
mfloat, myint, fname = 33.33, 33, "Bilal"
print(mfloat)
print(myint)
print(fname)

33.33
33
Bilal

In [5]:
## Example 1
height,age,name=6.1,21,"Amna miraj"
print(height)
print(age)
print(name)

## Example 2
name,address,gmail="Amna miraj","Lahore cantt","amnamiraj@gmail.com"
print(name)
print(address)
print(gmail)

6.1
21
Amna miraj
Amna miraj
Lahore cantt
amnamiraj@gmail.com

**_Example 3_**
* Assign single value to multiple variables

In [2]:
mfloat = myint= fname = "sohail"
print(mfloat)
print(myint)
print(fname)

sohail
sohail
sohail

In [4]:
## Example 1
first_name=last_name=name="Amna miraj"
print(first_name)
print(last_name)
print(name)

## Example 2
age=weight=height=32
print(age)
print(weight)
print(height)

Amna miraj
Amna miraj
Amna miraj
32
32
32

**_Example 4_**
* Output variable declaration
* In Python + character is used to combine the output of text and a varaiable.

In [ ]:
x = "Interesting"
print("Machince learning is " + x)

Machince learning is Interesting

In [8]:
## Example 1
a="Amna Miraj"
print("My name is "+ a)

## Example 2
y="computer science student"
print("I am a "+ y)

My name is Amna Miraj
I am a computer science student

### 2.1.1. Local Variable  
* Scope of the variables is limited, within function is called local variable.
<br>

**_Example_**
* Local variable declaration

In [ ]:
def myfunction():
    var = "Machine Learning is Interesting"
    print(var)
myfunction()

Machine Learning is Interesting

In [11]:
## Example 1
def introduction():
    intro="My name is amna miraj"
    print(intro)
introduction()

## Example 2
def my_age():
    age=21
    print("My age is",age)
my_age()

My name is amna miraj
My age is 21

### 2.1.2. Global Variables
* The variables declare outside the function is called Global variable.
* Scope of Global variable is within function and outside function.()
<br>

**_Example_**
* Global variable declaration

In [15]:
var = "interesting"

def myfunction():
  var1 = "Logical"
  print("Machine learning " + var1)

myfunction()

print("Python is " + var)

Machine learning Logical
Python is interesting

In [17]:
color="Black"
def favourite_color():
    color1="Blue"
    print("My favourite color is",color1)
favourite_color()

print("My favourite color is",color)

My favourite color is Blue
My favourite color is Black

### 2.1.3. Use of Global keyword
* We use Global keyword with any variable to make it Global
<br>

**_Example_**
* Use of Global keyword

In [ ]:
var = "interesting"

def myfunction():
    global var1
    var1= "Logical"
    print("Machine learning " + var) #print the Global variable

myfunction()

print("Python is " + var1) #Print the Local variable after make it Global using Global keyword

Machine learning interesting
Python is Logical

In [24]:
## Example 1
color="Black"
def favourite_color():
    global color1
    color1="Blue"
    print("My favourite color is "+ color)
favourite_color()

print("My favourite color is "+ color1)


## Example 2
age=20
def my_age():
    global age1
    age1=21
    print("My age is:",age)
my_age()
print("My age is:",age1)

My favourite color is Black
My favourite color is Blue
My age is: 20
My age is: 21

## 2.2. Numbers
* It stores numerical data of different types
* Python supports three types of numbers or numerical data
  * Integer
  * Floating point
  * Complex numbers

### 2.2.1 Integer number
* Int or integer is a whole number without decimals
* positive or negative
* Unlimited length of integer
<br>

**_Example 1_**

In [ ]:
myint = 33
print(myint)

33

In [ ]:
33 #integer number

33

In [ ]:
3+3 #Add two integers

6

In [29]:
## Example 1
number=45
print(number)

## Example 2
variable=67
print(variable)

45
67

In [ ]:
## integer number 
45

45

In [ ]:
## integer number 
67

67

In [ ]:
## sum of integers
4+5

9

In [ ]:
## sum of integers 
6+7

13

**_Example 2_**
* Print the datatype

In [ ]:
myint = 33
print(myint)
print(type(myint))

33
<class 'int'>

In [35]:
## Example 1
age=32
print(age)
print(type(age))

## Example 2
weight=58
print(weight)
print(type(weight))

32
<class 'int'>
58
<class 'int'>

### 2.2.2. Floating point number
* Float, or "floating point number"
* Number should be positive or negative
* Number containing one or more decimals.
<br>

**_Example 1_**

In [ ]:
myfloat = 33.33
print(myfloat)
print(type(myfloat))

33.33
<class 'float'>

In [37]:
## Example 1
height=6.1
print(height)
print(type(height))

## Example 2
variable=45.89
print(variable)
print(type(variable))

6.1
<class 'float'>
45.89
<class 'float'>

In [ ]:
33.33

33.33

In [ ]:
## float_number 
6.1

6.1

In [ ]:
33.33+33.33

66.66

In [39]:
## Sum of two float numbers 
6.1+6.1

12.2

In [ ]:
33.

33.0

In [ ]:
## float number
6.

6.0

In [ ]:
.33

0.33

In [41]:
## float number 
.1

0.1

### 2.2.3. Complex number
* **"j"** is written as the imaginary part in complex numbers.
<br>

**_Example 1_**

In [ ]:
var = 3+3j
var1 = 3j
var2 = -5j

print(type(var))
print(type(var1))
print(type(var2))

<class 'complex'>
<class 'complex'>
<class 'complex'>

In [ ]:
## Example 1
num=8j
num1=-7j
num2=4+5j
print(num)
print(num1)
print(num2)
print(type(num))
print(type(num1))
print(type(num2))

8j
(-0-7j)
(4+5j)
<class 'complex'>
<class 'complex'>
<class 'complex'>

## 2.3. Strings
* In Python string is written in single quot or double quot.
* 'Python' is the same as "Python".
* String contain sequence of charachers and used to store words that contain letters, numbers and special characters.
<br>

**_Example_**
<br>
* Print a string

In [3]:
Fname = "Tahir"
Lname = 'Sohail'
print(Fname,Lname)

Tahir Sohail

In [50]:
## Example 1
degree="BS"
discipline="Computer Science"
print(degree+" "+discipline)

## Example 2
string="My age is "
age="21"
print(string+age)

BS Computer Science
My age is 21

### 2.3.1. String Length
* The Funcation len() is used to count the length of a string.
<br>

**_Example_**

In [4]:
Name = "Tahir, Sohail !"
print(len(Name))

15

In [45]:
## Example 1
string_python="The string definition in python"
print("The lenght of the string is:",len(string_python))

## Example 2
expression="A+B/C"
print("The lenght of the string is:",len(expression))

The lenght of the string is: 31
The lenght of the string is: 5

### 2.3.2. String Methods
* There are some built-in methods of string.
  * strip()
  * lower()
  * upper()
  * replace()
  * split()
<br>

**_Example_**
* **Strip()** that remove the white space from the start and end of a string

In [ ]:
string = " Machine, Learning! "
print(string.strip()) # returns "Machine, Learning!"

Machine, Learning!

In [52]:
## Example 1
my_string=" My name is Amna miraj "
print(my_string.strip()) 

## Example 2
String="  Python programming "
print(String.strip())

My name is Amna miraj
Python programming


**_Example_**
* **Lower()** function is used to convert the string into lower case

In [ ]:
string = " Machine, Learning! "
print(string.lower()) # returns "machine, learning!"

 machine, learning!

In [54]:
## Example 1
my_string="My name is Amna miraj"
print(my_string.lower()) 

## Example 2
String="Python programming"
print(String.lower())

my name is amna miraj
python programming

**_Example_**
* **Upper()** function is used to convert the string into upper case

In [ ]:
string = " machine, learning! "
print(string.upper()) # returns "Machine, Learning!"

 MACHINE, LEARNING!

In [55]:
## Example 1
my_string="My name is Amna miraj"
print(my_string.upper()) 

## Example 2
String="Python programming"
print(String.upper())

MY NAME IS AMNA MIRAJ
PYTHON PROGRAMMING

**_Example_**
* **replace()** function is used to replace the string with other string

In [ ]:
string = "Machine, Learning!"
print(string.replace("Machine", "Python"))

Python, Learning!

In [56]:
## Example 1
my_string="My name is Amna miraj"
print(my_string.replace("Amna miraj", "fatima ali")) 

## Example 2
String="Python programming"
print(String.replace("Python", "c++"))

My name is fatima ali
c++ programming

**_Example_**
* **split()** function is used to splits the string into instances

In [ ]:
string = "Machine, Learning!"
print(string.split(","))

['Machine', ' Learning!']

In [59]:
## Example 1
my_string="My name , is Amna miraj"
print(my_string.split(",")) 

## Example 2
String="Python , programming"
print(String.split(","))

['My name ', ' is Amna miraj']
['Python ', ' programming']

### 2.3.3  Acess values in String
<br>

* Python doesn't support Character data type. These are treated as Strings of length one.
* Square brackets are used to access substrings.
* We can access a specific character or range of characters from string.

**_Examle_**

In [ ]:
string_type_variable = 'Machine Learning'
print("string_type_variable[1]:", string_type_variable[1])
print("string_type_variable[2:6]:", string_type_variable[2:6])

string_type_variable[1]: a
string_type_variable[2:6]: chin

In [63]:
## Example 1
string="I am currently studying in UMT"
print("string[2]:",string[2])

## Example 2
string_name="My name is amna miraj"
print("string_name[3:7]:",string_name[3:7])

string[2]: a
string_name[3:7]: name

### 2.3.4 Updating the String
* Value of the string can be updated by assigning a new value to it. New value will be replaced with older.
* New value must be related (having same data type) to previous value of the string.
* '+' operator will be used for this purpose like as follows:

**_Example_**

In [ ]:
string_type_variable = "Machine Learning"
string_type_variable = string_type_variable[:8] + "Traning"
print("Updated string: ", string_type_variable)

Updated string:  Machine Traning

In [76]:
## Example 1
string="I am currently studying in UMT"
string=string[:27]+ "Compsats"
print("Updated string:",string)

## Example 2
string_name="My name is amna miraj"
string_name=string_name[:11]+ "Fatima Ali"
print("Updated string:",string_name)

Updated string: I am currently studying in Compsats
Updated string: My name is Fatima Ali

### 2.3.5  String special operators <br>
* Some special operators are used in Python to assist the user. These are the followings given bellow.
  * String Concatenation **"+"**
  * String Repetition **"*"**
  * Get Range of character **"[]"**
  * Existance of character in a string **"In"**
  * No Existance of character in a string **"not In"**
<br>

**_Example_** <br>
* To **concatenate** the string **"+"** operator is used

In [ ]:
string_variable = "Machine"
print(string_variable+"Learning")

MachineLearning

In [82]:
## Example 1
string="Python"
print(string+" "+"Programming.")

## Example 2
string_name="Machine Learning"
print(string_name+" "+"is my technical elective for this semester.")

Python Programming.
Machine Learning is my technical elective for this semester.

**_Example_** <br>
* For the **Repetition** of string **"*"** operator is used

In [ ]:
string_variable = "Machine "
print(string_variable*5)

Machine Machine Machine Machine Machine

In [85]:
## Example 1
string="Amna "
print(string*5)

## Example 2
string1="Miraj "
print(string1*5)

Amna Amna Amna Amna Amna
Miraj Miraj Miraj Miraj Miraj

**_Example_** <br>
* Get the **range** of characters from string **'[]'** is used

In [ ]:
string_variable = "Machine"
print(string_variable[1:6])

achin

In [89]:
## Example 1
string="Amna Miraj"
print("The range of character from string is:",string[2:6])

## Example 2
string1="Miraj Khan"
print("The range of character from string is:",string1[3:8])

The range of character from string is: na M
The range of character from string is: aj Kh

**_Example_** <br>
* Existance of character in a string **"In"** is used
* If character exists it returns true otherwise it returns false

In [ ]:
string_variable = "Machine"
print('M' in string_variable)

True

In [ ]:
string_variable = "Machine"
print('K' in string_variable)

False

In [91]:
## Example 1
string="University of managment and technology"
print("U" in string)

True

In [93]:
## Example 2
string1="University of central punjab"
print("I"in string1)

False

**_Example_** <br>
* No Existance of character in a string **"not In"** is used
* In this case if charachter not exist in a string it returns true otherwise it returns Fale

In [ ]:
string_variable = "Machine"
print('K' not in string_variable)

True

In [ ]:
string_variable = "Machine"
print('M' not in string_variable)

False

In [ ]:
## Example 1
string="Amna Miraj"
print("a" not in string)

False

In [95]:
## Example 2
string1="UMT"
print("s" not in string1)

True

### 2.3.6  String formatting operator
* String formatting operator used within the print statement.
<br>

**_Example_**
* **%s** for string and **%d** for number

In [ ]:
print ("Python is %s Language and released in %d !" % ("Powerful",1991))

Python is Powerful Language and released in 1991 !

In [97]:
## Example 1
print("My name is %s My birth date is %d march %d."%("Amna miraj",12,2004))

My name is Amna miraj My birth date is 12 march 2004.

In [99]:
## Example 2
print("I am studing %s as in batch %d."%("BS CS",2023))

I am studing BS CS as in batch 2023.

## 2.4 Lists
* In python list is a ordered and changeable collection of values.  
* List Allows to contain duplicate values.
* In List Different types of data can be stored .
* First index in list is 0.

### 2.4.1 Create a List
**_Example_**
* Creation of a List
* List can be created as follows

In [6]:
My_list = ["Tahir", "Sohail", "Bilal"]
print(My_list)

['Tahir', 'Sohail', 'Bilal']

In [100]:
## Example 1
list=["Apple","Banana","Cherry","Rasberry"]
print(list)

['Apple', 'Banana', 'Cherry', 'Rasberry']

In [101]:
## Example 2
list1=["Potato","Tomato","Beetroot","Salad leaves"]
print(list1)

['Potato', 'Tomato', 'Beetroot', 'Salad leaves']

### 2.4.2 Accessing values of a Lists
* In Python list items can be access by using index number
* specific range of values also be accessed in python List
<br>

**_Example 1_**
* Print the third value of list

In [11]:
My_list = ["Tahir", "Sohail", "Bilal"]
print(My_list[2])

Bilal

In [102]:
## Example 1
list=["Apple","Banana","Cherry","Rasberry"]
print(list[3])

Rasberry

In [103]:
## Example 2
list1=["Potato","Tomato","Beetroot","Salad leaves"]
print(list1[2])

Beetroot

**_Example 2_**
* List start from 0 Index

In [12]:
My_list = ["Tahir", "Sohail", "Bilal","1198","2000","2002"]
print ("List first value is: ", My_list[0])

List first value is:  Tahir

In [105]:
## Example 1
list=["Apple","Banana","Cherry","Rasberry","Stawberry","Kiwi"]
print("The first value of my list is:",list[0])

The first value of my list is: Apple

In [106]:
## Example 2
list1=[10,20,40,55,23,44,11,34,55]
print("The first value of my list is:",list1[0])

The first value of my list is: 10

**_Example 3_**
* Range of list values

In [13]:
My_list = ["Tahir", "Waqas", "Bilal","1198","2000","2002"]
print ("List all values:")
print (My_list)
print("\n")
print ("List values from [1:5] is: ")
print (My_list[1:5])

List all values:
['Tahir', 'Waqas', 'Bilal', '1198', '2000', '2002']


List values from [1:5] is:
['Waqas', 'Bilal', '1198', '2000']

In [110]:
## Example 1
Fruits=["Apple","Banana","Cherry","Rasberry","Stawberry","Kiwi"]
print("List of all fruits:")
print(Fruits)
print("\n")
print("List fruits from [2:6] is: ")
print(Fruits[2:6])

List of all fruits:
['Apple', 'Banana', 'Cherry', 'Rasberry', 'Stawberry', 'Kiwi']


List fruits from [2:6] is:
['Cherry', 'Rasberry', 'Stawberry', 'Kiwi']

In [111]:
## Example 2
list1=[10,20,40,55,23,44,11,34,55]
print("List of all integers:")
print(list1)
print("\n")
print("List of integers from [0:5] is: ")
print(list1[0:5])

List of all integers:
[10, 20, 40, 55, 23, 44, 11, 34, 55]


List of integers from [0:5] is:
[10, 20, 40, 55, 23]

### 2.4.3 Update the values of a Lists
* In Python we can update single of multiple values of list
* In Python we can update the lists without function
<br>

**_Example_**
* Update the list without any function (simple way)

In [14]:
My_list = ["Tahir", "Sohail", "Bilal","1198","2000","2002"];
print ("List before update: ")
print (My_list)
print("\n")
My_list[1]= "Muhammad Waqas"
print ("List after updation: ")
print (My_list)

List before update:
['Tahir', 'Sohail', 'Bilal', '1198', '2000', '2002']


List after updation:
['Tahir', 'Muhammad Waqas', 'Bilal', '1198', '2000', '2002']

In [112]:
## Example 1
Fruits=["Apple","Banana","Cherry","Rasberry","Stawberry","Kiwi"]
print("List of all fruits before updation: ")
print(Fruits)
print("\n")
Fruits[2]="Water melon"
print("List of all fruits after updation: ")
print(Fruits)

List of all fruits before updation:
['Apple', 'Banana', 'Cherry', 'Rasberry', 'Stawberry', 'Kiwi']


List of all fruits after updation:
['Apple', 'Banana', 'Water melon', 'Rasberry', 'Stawberry', 'Kiwi']

In [113]:
## Example 2
list1=[10,20,40,55,23,44,11,34,55]
print("List of all integers before updation: ")
print(list1)
print("\n")
list1[3]=400
print("List of all integers after updation: ")
print(list1)

List of all integers before updation:
[10, 20, 40, 55, 23, 44, 11, 34, 55]


List of all integers after updation:
[10, 20, 40, 400, 23, 44, 11, 34, 55]

### 2.4.4 Add the values of a Lists
* Add the new values in a list using **append()** method
* Add value in a specific location using **insert()** method
<br>

**_Example_**
* New value interst in the end of the List using **append()**

In [15]:
My_list = ["Tahir", "Waqas", "Bilal","1198"]
print ("List before new value addition: ")
print (My_list)
print("\n")
My_list.append("iqra")
print ("List after new value addition: ")
print (My_list)

List before new value addition:
['Tahir', 'Waqas', 'Bilal', '1198']


List after new value addition:
['Tahir', 'Waqas', 'Bilal', '1198', 'iqra']

In [114]:
## Example 1
Fruits=["Apple","Banana","Cherry","Rasberry","Stawberry","Kiwi"]
print("List before new value addition: ")
print(Fruits)
print("\n")
Fruits.append("Orange")
print("List after new value addition: ")
print(Fruits)

List before new value addition:
['Apple', 'Banana', 'Cherry', 'Rasberry', 'Stawberry', 'Kiwi']


List after new value addition:
['Apple', 'Banana', 'Cherry', 'Rasberry', 'Stawberry', 'Kiwi', 'Orange']

In [115]:
## Example 2
list1=[10,20,40,55,23,44,11,34,55]
print("List before new value addition: ")
print(list1)
print("\n")
list1.append(657)
print("List after new value addition: ")
print(list1)

List before new value addition:
[10, 20, 40, 55, 23, 44, 11, 34, 55]


List after new value addition:
[10, 20, 40, 55, 23, 44, 11, 34, 55, 657]

In [116]:
My_list = ["Tahir", "Waqas", "Bilal","1198"];
print ("List before new value addition: ")
print (My_list)
print("\n")
My_list.insert(1,"iqra")
print ("List after new value addition: ")
print (My_list)

List before new value addition:
['Tahir', 'Waqas', 'Bilal', '1198']


List after new value addition:
['Tahir', 'iqra', 'Waqas', 'Bilal', '1198']

In [117]:
## Example 1
Fruits=["Apple","Banana","Cherry","Rasberry","Stawberry","Kiwi"]
print("List before new value addition: ")
print(Fruits)
print("\n")
Fruits.insert(3,"Orange")
print("List after new value addition: ")
print(Fruits)

List before new value addition:
['Apple', 'Banana', 'Cherry', 'Rasberry', 'Stawberry', 'Kiwi']


List after new value addition:
['Apple', 'Banana', 'Cherry', 'Orange', 'Rasberry', 'Stawberry', 'Kiwi']

In [118]:
## Example 2
list1=[10,20,40,55,23,44,11,34,55]
print("List before new value addition: ")
print(list1)
print("\n")
list1.insert(5,657)
print("List after new value addition: ")
print(list1)

List before new value addition:
[10, 20, 40, 55, 23, 44, 11, 34, 55]


List after new value addition:
[10, 20, 40, 55, 23, 657, 44, 11, 34, 55]

### 2.4.5 Delete the values of a Lists
* There are multiple methods to delete the values of a list. These are the followings
  * **del** keyword is used to delete the any value when you know the index of that value .
  * **remove()** method can be used delete any specific value or item
  * **pop()** is used to delete specified index, if the index of value is not known it removes the last item from the list
  * **clear()** method is use to delete all itmes from the list
<br>

**_Example 1_**
* Delete item from List using **"del"** keyword

In [17]:
My_list = ["Tahir", "Waqas", "Bilal","1198"];
print ("List before delete the value: ")
print (My_list)
print("\n")
del My_list[3]
print ("List after delete the value: ")
print (My_list)

List before delete the value:
['Tahir', 'Waqas', 'Bilal', '1198']


List after delete the value:
['Tahir', 'Waqas', 'Bilal']

In [119]:
## Example 1
Fruits=["Apple","Banana","Cherry","Rasberry","Stawberry","Kiwi"]
print("List before delete the value: ")
print(Fruits)
print("\n")
del Fruits[2]
print("List after delete the value: ")
print(Fruits)

List before delete the value:
['Apple', 'Banana', 'Cherry', 'Rasberry', 'Stawberry', 'Kiwi']


List after delete the value:
['Apple', 'Banana', 'Rasberry', 'Stawberry', 'Kiwi']

**_Example_**
* Delete item from List using **remove()** method

In [120]:
## Example 2
list1=[10,20,40,55,23,44,11,34,55]
print("List before delete the value: ")
print(list1)
print("\n")
del list1[6]
print("List after delete the value: ")
print(list1)

List before delete the value:
[10, 20, 40, 55, 23, 44, 11, 34, 55]


List after delete the value:
[10, 20, 40, 55, 23, 44, 34, 55]

In [18]:
My_list = ["Tahir", "Waqas", "Bilal","1198"];
print ("List before delete the item: ")
print (My_list)
print("\n")
My_list.remove('Bilal')
print ("List after delete the item: ")
print (My_list)

List before delete the item:
['Tahir', 'Waqas', 'Bilal', '1198']


List after delete the item:
['Tahir', 'Waqas', '1198']

In [121]:
## Example 1
Fruits=["Apple","Banana","Cherry","Rasberry","Stawberry","Kiwi"]
print("List before delete the value: ")
print(Fruits)
print("\n")
Fruits.remove("Rasberry")
print("List after delete the value: ")
print(Fruits)

List before delete the value:
['Apple', 'Banana', 'Cherry', 'Rasberry', 'Stawberry', 'Kiwi']


List after delete the value:
['Apple', 'Banana', 'Cherry', 'Stawberry', 'Kiwi']

In [122]:
## Example 2
list1=[10,20,40,55,23,44,11,34,55]
print("List before delete the value: ")
print(list1)
print("\n")
list1.remove(20)
print("List after delete the value: ")
print(list1)

List before delete the value:
[10, 20, 40, 55, 23, 44, 11, 34, 55]


List after delete the value:
[10, 40, 55, 23, 44, 11, 34, 55]

**_Example_**
* Delete item from List using **pop()** method

In [19]:
My_list = ["Tahir", "Waqas", "Bilal","1198"];
print ("My_list before delete the item: ")
print (My_list)
print("\n")
My_list.pop()
print ("My_list after delete the item: ")
print (My_list)

My_list before delete the item:
['Tahir', 'Waqas', 'Bilal', '1198']


My_list after delete the item:
['Tahir', 'Waqas', 'Bilal']

In [123]:
## Example 1
Fruits=["Apple","Banana","Cherry","Rasberry","Stawberry","Kiwi"]
print("List before delete the value: ")
print(Fruits)
print("\n")
Fruits.pop()
print("List after delete the value: ")
print(Fruits)

List before delete the value:
['Apple', 'Banana', 'Cherry', 'Rasberry', 'Stawberry', 'Kiwi']


List after delete the value:
['Apple', 'Banana', 'Cherry', 'Rasberry', 'Stawberry']

In [124]:
## Example 2
list1=[10,20,40,55,23,44,11,34,55]
print("List before delete the value: ")
print(list1)
print("\n")
list1.pop()
print("List after delete the value: ")
print(list1)

List before delete the value:
[10, 20, 40, 55, 23, 44, 11, 34, 55]


List after delete the value:
[10, 20, 40, 55, 23, 44, 11, 34]

**_Example 4_**
* Delete the List using **clear()** method, it removes all itmes

In [20]:
My_list = ["Tahir", "Waqas", "Bilal","1198"];
print ("My_list before delete the item: ")
print (My_list)
print("\n")
My_list.clear()
print ("My_list after delete the item: ")
print (My_list)

My_list before delete the item:
['Tahir', 'Waqas', 'Bilal', '1198']


My_list after delete the item:
[]

In [125]:
## Example 1
Fruits=["Apple","Banana","Cherry","Rasberry","Stawberry","Kiwi"]
print("List before delete the value: ")
print(Fruits)
print("\n")
Fruits.clear()
print("List after delete the value: ")
print(Fruits)

List before delete the value:
['Apple', 'Banana', 'Cherry', 'Rasberry', 'Stawberry', 'Kiwi']


List after delete the value:
[]

In [126]:
## Example 2
list1=[10,20,40,55,23,44,11,34,55]
print("List before delete the value: ")
print(list1)
print("\n")
list1.clear()
print("List after delete the value: ")
print(list1)

List before delete the value:
[10, 20, 40, 55, 23, 44, 11, 34, 55]


List after delete the value:
[]

### 2.4.6 Reverse the List
* The **reverse()** method is used to reverse the order of the list
<br>

**_Example_**
* Reverse the order of list

In [21]:
My_list = ["Tahir", "Waqas", "Bilal","1198"];
print ("My_list in origional form: ")
print (My_list)
print("\n")
My_list.reverse()
print ("My_list after reverse order: ")
print (My_list)

My_list in origional form:
['Tahir', 'Waqas', 'Bilal', '1198']


My_list after reverse order:
['1198', 'Bilal', 'Waqas', 'Tahir']

In [127]:
## Example 1
Fruits=["Apple","Banana","Cherry","Rasberry","Stawberry","Kiwi"]
print("My list in origional form: ")
print(Fruits)
print("\n")
Fruits.reverse()
print("My list after reverse order: ")
print(Fruits)

My list in origional form:
['Apple', 'Banana', 'Cherry', 'Rasberry', 'Stawberry', 'Kiwi']


My list after reverse order:
['Kiwi', 'Stawberry', 'Rasberry', 'Cherry', 'Banana', 'Apple']

In [128]:
## Example 2
list1=[10,20,40,55,23,44,11,34,55]
print("My list in origional form: ")
print(list1)
print("\n")
list1.reverse()
print("My list after reverse order: ")
print(list1)

My list in origional form:
[10, 20, 40, 55, 23, 44, 11, 34, 55]


My list after reverse order:
[55, 34, 11, 44, 23, 55, 40, 20, 10]

### 2.4.7 List Sorting
* The **sort()** method is used to sort the list alphabetically
<br>

**_Example_**
* sort the given list

In [22]:
My_list = ["Tahir", "Waqas", "Bilal","1199"];
print ("My_list before sorting: ")
print (My_list)
print("\n")
My_list.sort()
print ("My_list after sorting: ")
print (My_list)

My_list before sorting:
['Tahir', 'Waqas', 'Bilal', '1199']


My_list after sorting:
['1199', 'Bilal', 'Tahir', 'Waqas']

In [ ]:
## Example 1
Fruits=["Apple","Banana","Cherry","Rasberry","Stawberry","Kiwi"]
print("My list before sorting: ")
print(Fruits)
print("\n")
Fruits.sort()
print("My list after sorting: ")
print(Fruits)

My_list before sorting:
['Apple', 'Banana', 'Cherry', 'Rasberry', 'Stawberry', 'Kiwi']


My_list after sorting:
['Apple', 'Banana', 'Cherry', 'Kiwi', 'Rasberry', 'Stawberry']

In [131]:
## Example 2
int=[10,20,40,55,23,44,11,34,55]
print("My list before sorting: ")
print(int)
print("\n")
int.sort()
print("My list after sorting: ")
print(int)

My list before sorting:
[10, 20, 40, 55, 23, 44, 11, 34, 55]


My list after sorting:
[10, 11, 20, 23, 34, 40, 44, 55, 55]

### 2.4.7 List Count
* The **count()** method is used to count the number of times any specific word occur in list  
<br>

**_Example_**
* Count word in List

In [23]:
My_list = ["Tahir", "Waqas", "Bilal","1199"];

variable_x=My_list.count("Tahir")
print ("No. of times Tahir occur in List: ", variable_x)

No. of times Tahir occur in List:  1

In [133]:
vegetables=["Potato","Beet root","Spinach","Salad leaves","Tomato","Potato"]
x=vegetables.count("Potato")
print("Number of times potato occurs in the list:",x)

Number of times potato occurs in the list: 2

In [134]:
## Example 2
int=[10,20,40,55,23,44,11,34,55,10,10,20,10,20]
var=int.count(10)
print("Number of times 10 occurs in the list:",var)

Number of times 10 occurs in the list: 4

## 2.5 Dictionaries
<br>

* It is similar to array, which is unordered collection
* Dictionaries have keys and values
* Dictionaries are written with curly brackets
* **colon(:)** is used as separator between key and values
* **comma(,)** is used to separate the keys
* Keys must be unique in dictionaries but no restrictions on values
* **{}** represents empty dictionary
* Any data type value can be stored in a dictionary and can be repeated
* The keys must of an Immutable data type such as Strings, Integers and tuples

### 2.5.1 Create a Dictionary
**_Example_**
* Creation of a dictionary is as follows

In [24]:
My_dictionary = {
  "First_Name": "Tahir",
  "Last_name": "Sohail",
  "DOB": 1998
}
print(My_dictionary)

{'First_Name': 'Tahir', 'Last_name': 'Sohail', 'DOB': 1998}

In [135]:
## Example 1
dictionary={
    "Name":"Amna Miraj",
    "Age":"21",
    "Email Address":"amnamiraj@gmail.com"
}
print(dictionary)

{'Name': 'Amna Miraj', 'Age': '21', 'Email Address': 'amnamiraj@gmail.com'}

In [136]:
## Example 2
car_dictionary={
    "Car_name":"Mercedes",
    "Color":"Black",
    "Model":2012
}
print(car_dictionary)

{'Car_name': 'Mercedes', 'Color': 'Black', 'Model': 2012}

### 2.5.2 Accessing values in a Dictionary
* In Python Dictionary items can be access by using specfied key
* **get()** method is also used to access the value
<br>

**_Example_**
* Access and print the Key First_name

In [25]:
My_dictionary = {
  "First_Name": "Tahir",
  "Last_name": "Sohail",
  "DOB": 1998
}
print("The value of key First_Name is: ", My_dictionary['First_Name'])

The value of key First_Name is:  Tahir

In [ ]:
## Example 1
dictionary={
    "Name":"Amna Miraj",
    "Age":"21",
    "Email Address":"amnamiraj@gmail.com"
}
print("The value of key Name is:",dictionary['Name'])
print("The value of key Email Address is:",dictionary['Email Address'])

The value of key Name is: Amna Miraj
The value of key Email Address is: amnamiraj@gmail.com

In [141]:
## Example 2
car_dictionary={
    "Car_name":"Mercedes",
    "Color":"Black",
    "Model":2012
}
print("The value of key Car Name is:",car_dictionary['Car_name'])
print("The value of key model is:",car_dictionary['Model'])

The value of key Car Name is: Mercedes
The value of key model is: 2012

**_Example_**
* Access and print the Key First_name by using **get()** method

In [26]:
My_dictionary = {
  "First_Name": "Tahir",
  "Last_name": "Sohail",
  "DOB": 1998
}
variable_x=My_dictionary.get("First_Name")
print("The value of key First_Name is: ", variable_x)

The value of key First_Name is:  Tahir

In [143]:
## Example 1
dictionary={
    "Name":"Amna Miraj",
    "Age":"21",
    "Email Address":"amnamiraj@gmail.com"
}
x=dictionary.get("Name")
y=dictionary.get("Email Address")
print("The value of key Name is:",x)
print("The value of key Email Address is:",y)

The value of key Name is: Amna Miraj
The value of key Email Address is: amnamiraj@gmail.com

In [144]:
## Example 2
car_dictionary={
    "Car_name":"Mercedes",
    "Color":"Black",
    "Model":2012
}
var1=car_dictionary.get("Car_name")
var2=car_dictionary.get("Color")
print("The value of key Car Name is:",var1)
print("The value of key model is:",var2)

The value of key Car Name is: Mercedes
The value of key model is: Black

### 2.5.3 Updating the values in a Dictionary
* In Python Dictionary we can update existing values
* we can add new more entries
<br>

**_Example 1_**
* Update existing value of a key

In [27]:
My_dictionary = {
  "First_Name": "Tahir",
  "Last_name": "Sohail",
  "DOB": 1998
}
print("My Dictionary before update: ")
print(My_dictionary)
print("\n")
My_dictionary['DOB']="22-02-1998"
print("My Dictionary before update: ")
print(My_dictionary)

My Dictionary before update:
{'First_Name': 'Tahir', 'Last_name': 'Sohail', 'DOB': 1998}


My Dictionary before update:
{'First_Name': 'Tahir', 'Last_name': 'Sohail', 'DOB': '22-02-1998'}

In [ ]:
## Example 1
dictionary={
    "Name":"Amna Miraj",
    "Age":"21",
    "Email Address":"amnamiraj@gmail.com"
}
print("My Dictionary before update: ")
print(dictionary)
print("\n")
dictionary['Age']="20"
print("My Dictionary after update: ")
print(dictionary)

My Dictionary before update:
{'Name': 'Amna Miraj', 'Age': '21', 'Email Address': 'amnamiraj@gmail.com'}


My Dictionary before update:
{'Name': 'Amna Miraj', 'Age': '20', 'Email Address': 'amnamiraj@gmail.com'}

In [147]:
## Example 2
car_dictionary={
    "Car_name":"Mercedes",
    "Color":"Black",
    "Model":2012
}
print("My Dictionary before update: ")
print(car_dictionary)
print("\n")
car_dictionary['Color']="White"
print("My Dictionary after update: ")
print(car_dictionary)

My Dictionary before update:
{'Car_name': 'Mercedes', 'Color': 'Black', 'Model': 2012}


My Dictionary after update:
{'Car_name': 'Mercedes', 'Color': 'White', 'Model': 2012}

**_Example 2_**
* Add the new key value pair in Dictionary

In [28]:
My_dictionary = {
  "First_Name": "Tahir",
  "Last_name": "Sohail",
  "DOB": 1998
}
print("My Dictionary before update: ")
print(My_dictionary)
print("\n")
My_dictionary['City']="Vehari"
print("My Dictionary before update: ")
print(My_dictionary)

My Dictionary before update:
{'First_Name': 'Tahir', 'Last_name': 'Sohail', 'DOB': 1998}


My Dictionary before update:
{'First_Name': 'Tahir', 'Last_name': 'Sohail', 'DOB': 1998, 'City': 'Vehari'}

In [148]:
## Example 1
dictionary={
    "Name":"Amna Miraj",
    "Age":"21",
    "Email Address":"amnamiraj@gmail.com"
}
print("My Dictionary before update: ")
print(dictionary)
print("\n")
dictionary['City']="Lahore"
print("My Dictionary after update: ")
print(dictionary)

My Dictionary before update:
{'Name': 'Amna Miraj', 'Age': '21', 'Email Address': 'amnamiraj@gmail.com'}


My Dictionary after update:
{'Name': 'Amna Miraj', 'Age': '21', 'Email Address': 'amnamiraj@gmail.com', 'City': 'Lahore'}

In [149]:
## Example 2
car_dictionary={
    "Car_name":"Mercedes",
    "Color":"Black",
    "Model":2012
}
print("My Dictionary before update: ")
print(car_dictionary)
print("\n")
car_dictionary['Body_style']="sedan"
print("My Dictionary after update: ")
print(car_dictionary)

My Dictionary before update:
{'Car_name': 'Mercedes', 'Color': 'Black', 'Model': 2012}


My Dictionary after update:
{'Car_name': 'Mercedes', 'Color': 'Black', 'Model': 2012, 'Body_style': 'sedan'}

### 2.5.4 Delete the values of a Dictionary
* We can delete single item from dictionary
* we can delete the complete dictionary
* There are two ways to delete given below
  * **del** keyword is used to delete single item with key name
  * **del** keyword can also delete the complete dictionary
  * **pop()** method is used to delete single item with key name
  * **popitem()** method is used to remove last key-value pair
  * **clear()"** method is used to remove complete dictionary
  
<br>

**_Example 1_**
* Delete single item from dictionary using **del**

In [29]:
My_dictionary = {
  "First_Name": "Tahir",
  "Last_name": "Sohail",
  "DOB": 1998
}
print("Dictionary before delete key-value pair: ")
print(My_dictionary)
print("\n")
del My_dictionary['DOB']
print("Dictionary after delete key-value pair: ")
print(My_dictionary)

Dictionary before delete key-value pair:
{'First_Name': 'Tahir', 'Last_name': 'Sohail', 'DOB': 1998}


Dictionary after delete key-value pair:
{'First_Name': 'Tahir', 'Last_name': 'Sohail'}

In [152]:
## Example 1
dictionary={
    "Name":"Amna Miraj",
    "Age":"21",
    "Email Address":"amnamiraj@gmail.com"
}
print("Dictionary before delete key-value pair: ")
print(dictionary)
print("\n")
del dictionary['Email Address']
print("Dictionary after delete key-value pair: ")
print(dictionary)

Dictionary before delete key-value pair:
{'Name': 'Amna Miraj', 'Age': '21', 'Email Address': 'amnamiraj@gmail.com'}


Dictionary after delete key-value pair:
{'Name': 'Amna Miraj', 'Age': '21'}

In [153]:
## Example 2
car_dictionary={
    "Car_name":"Mercedes",
    "Color":"Black",
    "Model":2012
}
print("Dictionary before delete key-value pair: ")
print(car_dictionary)
print("\n")
del car_dictionary['Color']
print("Dictionary after delete key-value pair: ")
print(car_dictionary)

Dictionary before delete key-value pair:
{'Car_name': 'Mercedes', 'Color': 'Black', 'Model': 2012}


Dictionary after delete key-value pair:
{'Car_name': 'Mercedes', 'Model': 2012}

**_Example 2_**
* Delete single item from dictionary using **pop()** method

In [30]:
My_dictionary = {
  "First_Name": "Tahir",
  "Last_name": "Sohail",
  "DOB": 1998
}
print("Dictionary before delete key-value pair: ")
print(My_dictionary)
print("\n")
My_dictionary.pop("DOB")
print("Dictionary after delete key-value pair: ")
print(My_dictionary)

Dictionary before delete key-value pair:
{'First_Name': 'Tahir', 'Last_name': 'Sohail', 'DOB': 1998}


Dictionary after delete key-value pair:
{'First_Name': 'Tahir', 'Last_name': 'Sohail'}

In [155]:
## Example 1
dictionary={
    "Name":"Amna Miraj",
    "Age":"21",
    "Email Address":"amnamiraj@gmail.com"
}
print("Dictionary before delete key-value pair: ")
print(dictionary)
print("\n")
dictionary.pop("Name")
print("Dictionary after delete key-value pair: ")
print(dictionary)

Dictionary before delete key-value pair:
{'Name': 'Amna Miraj', 'Age': '21', 'Email Address': 'amnamiraj@gmail.com'}


Dictionary after delete key-value pair:
{'Age': '21', 'Email Address': 'amnamiraj@gmail.com'}

In [156]:
## Example 2
car_dictionary={
    "Car_name":"Mercedes",
    "Color":"Black",
    "Model":2012
}
print("Dictionary before delete key-value pair: ")
print(car_dictionary)
print("\n")
car_dictionary.pop("Car_name")
print("Dictionary after delete key-value pair: ")
print(car_dictionary)

Dictionary before delete key-value pair:
{'Car_name': 'Mercedes', 'Color': 'Black', 'Model': 2012}


Dictionary after delete key-value pair:
{'Color': 'Black', 'Model': 2012}

**_Example 3_**
* Delete item from dictionary using **popitem()** method

In [31]:
My_dictionary = {
  "First_Name": "Tahir",
  "Last_name": "Sohail",
  "DOB": 1998
}
print("Dictionary before delete key-value pair: ")
print(My_dictionary)
print("\n")
My_dictionary.popitem()
print("Dictionary after delete key-value pair: ")
print(My_dictionary)

Dictionary before delete key-value pair:
{'First_Name': 'Tahir', 'Last_name': 'Sohail', 'DOB': 1998}


Dictionary after delete key-value pair:
{'First_Name': 'Tahir', 'Last_name': 'Sohail'}

In [158]:
## Example 1
dictionary={
    "Name":"Amna Miraj",
    "Age":"21",
    "Email Address":"amnamiraj@gmail.com"
}
print("Dictionary before delete key-value pair: ")
print(dictionary)
print("\n")
dictionary.popitem()
print("Dictionary after delete key-value pair: ")
print(dictionary)

Dictionary before delete key-value pair:
{'Name': 'Amna Miraj', 'Age': '21', 'Email Address': 'amnamiraj@gmail.com'}


Dictionary after delete key-value pair:
{'Name': 'Amna Miraj', 'Age': '21'}

In [159]:
## Example 2
car_dictionary={
    "Car_name":"Mercedes",
    "Color":"Black",
    "Model":2012
}
print("Dictionary before delete key-value pair: ")
print(car_dictionary)
print("\n")
car_dictionary.popitem()
print("Dictionary after delete key-value pair: ")
print(car_dictionary)

Dictionary before delete key-value pair:
{'Car_name': 'Mercedes', 'Color': 'Black', 'Model': 2012}


Dictionary after delete key-value pair:
{'Car_name': 'Mercedes', 'Color': 'Black'}

**_Example 4_**
* Delete the complete dictionary using **clear()** Method

In [32]:
My_dictionary = {
  "First_Name": "Tahir",
  "Last_name": "Sohail",
  "DOB": 1998
}
print("Dictionary before clear: ")
print(My_dictionary)
print("\n")
My_dictionary.clear()
print("Dictionary after clear: ")
print(My_dictionary)

Dictionary before clear:
{'First_Name': 'Tahir', 'Last_name': 'Sohail', 'DOB': 1998}


Dictionary after clear:
{}

In [161]:
## Example 1
dictionary={
    "Name":"Amna Miraj",
    "Age":"21",
    "Email Address":"amnamiraj@gmail.com"
}
print("Dictionary before deleteing dictionary: ")
print(dictionary)
print("\n")
dictionary.clear()
print("Dictionary after deleteing dictionary: ")
print(dictionary)

Dictionary before deleteing dictionary:
{'Name': 'Amna Miraj', 'Age': '21', 'Email Address': 'amnamiraj@gmail.com'}


Dictionary after deleteing dictionary:
{}

In [162]:
## Example 2
car_dictionary={
    "Car_name":"Mercedes",
    "Color":"Black",
    "Model":2012
}
print("Dictionary before deleteing dictionary: ")
print(car_dictionary)
print("\n")
car_dictionary.clear()
print("Dictionary after deleteing dictionary: ")
print(car_dictionary)

Dictionary before deleteing dictionary:
{'Car_name': 'Mercedes', 'Color': 'Black', 'Model': 2012}


Dictionary after deleteing dictionary:
{}

### 2.5.5 Dictionary Length
* **len()** method is used to check the length of a string
<br>

**_Example_**

In [33]:
My_dictionary = {
  "First_Name": "Tahir",
  "Last_name": "Sohail",
  "DOB": 1998
}
print("The length of a Dictionary is: ", len(My_dictionary))

The length of a Dictionary is:  3

In [165]:
## Example 1
dictionary={
    "Name":"Amna Miraj",
    "Age":"21",
    "Email Address":"amnamiraj@gmail.com",
    "Weight":58
}
print("The length of a Dictionary is: ", len(dictionary))

The length of a Dictionary is:  4

In [163]:
## Example 2
car_dictionary={
    "Car_name":"Mercedes",
    "Color":"Black",
    "Model":2012
}
print("The length of a Dictionary is: ", len(car_dictionary))

The length of a Dictionary is:  3

## 2.6 Tuples
<br>

* Tuples are the collection of objects like Lists but Tuple is immutable.
* **comma (,)** is used as seperator between items in Tubple.
* Tuples are written with round brackets().
* **()** represents the empty Tuple.
* **comma(,)** must include in a Tuple even you have only one value
* Multiple datatypes should be used in Tuples

<br>

### 2.6.1 Create a Tuple
**_Example_**
* Creation of a Tuple is as follows

In [34]:
My_Tuple = ("Tahir", "Waqas", "Bilal", "iqra","1998")
print(My_Tuple)

('Tahir', 'Waqas', 'Bilal', 'iqra', '1998')

In [ ]:
## Example 1
First_tuple=("Chemistry","Physics","Maths","Biology","English")
print(First_tuple)

('Chemistry', 'Physics', 'Maths', 'Biology', 'English')

In [168]:
## Example 2
Second_tuple=("CS","AI","DS","BT","IT","MB")
print(Second_tuple)

('CS', 'AI', 'DS', 'BT', 'IT', 'MB')

**_Example 2_**
* **comma(,)** must include in a Tuple even you have only one value

In [170]:
My_Tuple = ("Tahir",)
print(My_Tuple)

('Tahir',)

In [171]:
## Example 1
First_tuple=("Chemistry",)
print(First_tuple)

('Chemistry',)

In [172]:
## Example 2
Second_tuple=("CS",)
print(Second_tuple)

('CS',)

### 2.6.2 Accessing values of a Tuple
* In Python Tuple items can be access by using index number
* specific range of values also be accessed in python Tuple
<br>

**_Example 1_**
* Print the third value of Tuple

In [36]:
My_Tuple = ("Tahir", "Waqas", "Bilal", "iqra","1998", "2000")

print ("Tuple first value is: ", My_Tuple[0])

Tuple first value is:  Tahir

In [174]:
## Example 1
First_tuple=("Chemistry","Physics","Maths","Biology","English")
print("Tuple first value is:",First_tuple[0])

Tuple first value is: Chemistry

In [177]:
## Example 2
Second_tuple=("CS","AI","DS","BT","IT","MB")
print("Tuple third value is:",Second_tuple[2])

Tuple third value is: DS

**_Example 2_**
* Access the Range of Tuple values

In [37]:
My_Tuple = ("Tahir", "Waqas", "Bilal", "iqra","1999", "1998")
print ("Tuple all values:")
print (My_Tuple)
print("\n")
print ("Tuple values from [1:5] is: ")
print (My_Tuple[1:5])

Tuple all values:
('Tahir', 'Waqas', 'Bilal', 'iqra', '1999', '1998')


Tuple values from [1:5] is:
('Waqas', 'Bilal', 'iqra', '1999')

In [179]:
## Example 1
First_tuple=("Chemistry","Physics","Maths","Biology","English")
print ("Tuple all values:")
print (First_tuple)
print("\n")
print ("Tuple values from [0:4] is: ")
print (First_tuple[0:4])

Tuple all values:
('Chemistry', 'Physics', 'Maths', 'Biology', 'English')


Tuple values from [0:4] is:
('Chemistry', 'Physics', 'Maths', 'Biology')

In [180]:
## Example 2
Second_tuple=("CS","AI","DS","BT","IT","MB","HR")
print ("Tuple all values:")
print (Second_tuple)
print("\n")
print ("Tuple values from [2:5] is: ")
print (Second_tuple[2:5])

Tuple all values:
('CS', 'AI', 'DS', 'BT', 'IT', 'MB', 'HR')


Tuple values from [2:5] is:
('DS', 'BT', 'IT')

### 2.6.3 Updating the values of a Tuple
* Tuples are read only
* A tuple is ordered and immutable or unchangeable.
* Tuple after convert into List is changeable

**_Example_**
* It gives an error when we try to item in a tuple

In [39]:
My_Tuple = ("Tahir", "Waqas", "Bilal", "iqra","1999", "1998")
My_Tuple[3] = "sidra" #This will gives an error
print (My_Tuple)

TypeError: 'tuple' object does not support item assignment

In [181]:
## Example 1
First_tuple=("Chemistry","Physics","Maths","Biology","English")
First_tuple[3]="Algebra" ## This will give an error
print(First_tuple)

TypeError: 'tuple' object does not support item assignment

### 2.6.4 Deleting the values of a Tuple
* Single item from Tuple is not deleted because its not changeable
* **del** keyword is used to delete the whole Tuple.

**_Example_**

* Delete the Tuple using **del** keyword

In [40]:
My_Tuple = ("Tahir", "Waqas", "Bilal", "iqra","1999", "2000")
print ("Tuple all values:")
print (My_Tuple)
print("\n")
del My_Tuple
print ("Tuple after deletion: ")
print (My_Tuple)#This will Gives an error message because Tuple no longer exists

Tuple all values:
('Tahir', 'Waqas', 'Bilal', 'iqra', '1999', '2000')


Tuple after deletion:

NameError: name 'My_Tuple' is not defined

In [182]:
## Example 1
First_tuple=("Chemistry","Physics","Maths","Biology","English")
print ("Tuple all values:")
print (First_tuple)
print("\n")
del First_tuple
print ("Tuple after deletion: ")
print (First_tuple)#This will Gives an error message because Tuple no longer exists

Tuple all values:
('Chemistry', 'Physics', 'Maths', 'Biology', 'English')


Tuple after deletion:

NameError: name 'First_tuple' is not defined

## 2.7 Sets

* Collection of unordered, unindexed items called sets.
* Sets are written with curly brackets {} in Python.
* No dulpicate items exist in Sets every item is unique
* Itmes are immutable (Not changeable), However, the set itself is unchangeab
* More items can be add or remove.
* **{}** represents empty set
* **comma (,)** is used as seperator between items in sets.
* Set is used to perform mathmatical operations
* set() Method is used to create a set from a list
* Two methods are used to delete the value from set
  * discard() method will not show an error (When value doesn't exists in set.)
  * remove() method will show an error(when value doesn't exists in set.)

### 2.7.1 Create a set
**_Example_**
* Creation of a set is as follows

In [41]:
My_set = {"Tahir", "Waqas", "Bilal"}
print(My_set)

{'Waqas', 'Tahir', 'Bilal'}

In [ ]:
## Example 1
set={1,2,3,4,5,6,7}
print(set)

{1, 2, 3, 4, 5, 6, 7}

In [184]:
## Example 2
set1={"red","blue","yellow","orange","purple"}
print(set1)

{'orange', 'blue', 'red', 'purple', 'yellow'}

### 2.7.2 Accessing values of a Set
* we can not access the value of a set because its unordered and unindexed
<br>

### 2.7.3 Add and Update items in a set
* In Python there are two methods to add items in a set
  * **add()** method is used to add single item
  * **update()** method is used for add more then one items
<br>

**_Example 1_**
* Add single item using **add()** method

In [42]:
My_set = {"Tahir", "Waqas", "Bilal"}
print("Set before addition of item:")
print(My_set)
print("\n")
My_set.add("Iqra")
print("Set after addition of item:")
print(My_set)

Set before addition of item:
{'Waqas', 'Tahir', 'Bilal'}


Set after addition of item:
{'Waqas', 'Iqra', 'Tahir', 'Bilal'}

In [186]:
## Example 1
set={1,2,3,4,5,6,7}
print("Set before addition of item:")
print(set)
print("\n")
set.add(8)
print("Set after addition of item:")
print(set)

Set before addition of item:
{1, 2, 3, 4, 5, 6, 7}


Set after addition of item:
{1, 2, 3, 4, 5, 6, 7, 8}

In [187]:
## Example 2
set1={"red","blue","yellow","orange","purple"}
print("Set before addition of item:")
print(set1)
print("\n")
set1.add("indigo")
print("Set after addition of item:")
print(set1)

Set before addition of item:
{'orange', 'blue', 'red', 'purple', 'yellow'}


Set after addition of item:
{'indigo', 'orange', 'blue', 'red', 'purple', 'yellow'}

**_Example 2_**
* Add items using **update()** method

In [43]:
My_set = {"Tahir", "Waqas", "Bilal"}
print("Set before addition of item:")
print(My_set)
print("\n")
My_set.update(["Iqra", "Sohail"])
print("Set after addition of item:")
print(My_set)

Set before addition of item:
{'Waqas', 'Tahir', 'Bilal'}


Set after addition of item:
{'Tahir', 'Iqra', 'Bilal', 'Waqas', 'Sohail'}

In [192]:
## Example 1
set1={1,2,3,4,5,6,7}
print("Set before addition of item:")
print(set1)
print("\n")
set1.update([8,9])
print("Set after addition of item:")
print(set1)

Set before addition of item:
{1, 2, 3, 4, 5, 6, 7}


Set after addition of item:
{1, 2, 3, 4, 5, 6, 7, 8, 9}

In [195]:
## Example 2
set1={"red","blue","yellow","orange","purple"}
print("Set before addition of item:")
print(set1)
print("\n")
set1.update(["indigo","golden","silver"])
print("Set after addition of item:")
print(set1)

Set before addition of item:
{'orange', 'blue', 'red', 'purple', 'yellow'}


Set after addition of item:
{'indigo', 'orange', 'silver', 'blue', 'red', 'purple', 'yellow', 'golden'}

### 2.7.4 Delete items in a set
* In Python there are two methods to delete items from a set
  * **remove()** method is used to delete the item
  * **discard()** method is used to delete the item
  * **pop()** method is also use to remove item
  * **clear()** method is also use to remove all items from set
  * **del** keyword also use to remove all items from sets
<br>

**_Example 1_**
* Delete item using **remove()** method

In [198]:
My_set = {"Tahir", "Waqas", "Bilal"}
print("Set of items:")
print(My_set)
print("\n")
My_set.remove("waqas")
print("Set after deletion of item:")
print(My_set) #it will gives an error because no longer item exist in a set.

Set of items:
{'Tahir', 'Bilal', 'Waqas'}

KeyError: 'waqas'

**_Example 2_**
* Delete item using **discard()** method

In [202]:
My_set = {"Tahir", "Waqas", "Bilal"}
print("Set of items:")
print(My_set)
print("\n")
My_set.discard("Waqas")
print("Set after deletion of item:")
print(My_set) #it will gives an error because no longer item exist in a set.

Set of items:
{'Tahir', 'Bilal', 'Waqas'}


Set after deletion of item:
{'Tahir', 'Bilal'}

**_Example 3_**
* Delete item using **pop()** method

In [46]:
My_set = {"Tahir", "Waqas", "Bilal"}
print("Set of items:")
print(My_set)
print("\n")
My_set.pop()
print("Set after deletion of item:")
print(My_set) #it will gives an error because no longer item exist in a set.

Set of items:
{'Waqas', 'Tahir', 'Bilal'}


Set after deletion of item:
{'Tahir', 'Bilal'}

**_Example 4_**
* Remove items using **clear()** method

In [47]:
My_set = {"Tahir", "Waqas", "Bilal"}
print("Set of items:")
print(My_set)
print("\n")
My_set.clear()
print("Set after deletion of item:")
print(My_set)

Set of items:
{'Waqas', 'Tahir', 'Bilal'}


Set after deletion of item:
set()

**_Example 5_**
* Delete items using **del** keyword from sets

In [48]:
My_set = {"Tahir", "Waqas", "Bilal"}
print("Set of items:")
print(My_set)
print("\n")
del My_set
print("Set after deletion of item:")
print(My_set) #it will gives an error because no longer item exist in a set.

Set of items:
{'Waqas', 'Tahir', 'Bilal'}


Set after deletion of item:

NameError: name 'My_set' is not defined

In [206]:
## Example 1
set1={1,2,3,4,5,6,7}
print("Set of items:")
print(set1)
print("\n")
set1.remove(4)
print("Set after deletion of item:")
print(set1)

Set of items:
{1, 2, 3, 4, 5, 6, 7}


Set after deletion of item:
{1, 2, 3, 5, 6, 7}

In [208]:
## Example 2
set1={"red","blue","yellow","orange","purple"}
print("Set of items:")
print(set1)
print("\n")
set1.clear()
print("Set after clering of all items:")
print(set1)

Set of items:
{'orange', 'blue', 'red', 'purple', 'yellow'}


Set after clering of all items:
set()

# 3. Operators
* Operators are used for different conditions on variables and values to perform multiple operations.
* Python support these group of operators given below
  * Arithmetic operators
  * Assignment operators
  * Comparison operators
  * Logical operators
  * Identity operators
  * Membership operators
  * Bitwise operators
  
## 3.1. Arithmetic operators
* Arithmetic operators are used to perform mathematical operations on numeric values.

**_Examples_**
* The operators perform common operations including addition, subtraction, multiplication, division and mod etc.

In [49]:
Number1 = 10
Number2 = 6
sum = Number1 + Number2 # Addition of numbers
print(sum)

16

In [50]:
Number1 = 10
Number2 = 6
sub = Number1 - Number2 # subtraction of numbers
print(sub)

4

In [ ]:
Number1 = 10
Number2 = 6
Mul = Number1 * Number2 # Multiplication of numbers
print(Mul)

60

In [ ]:
Number1 = 10
Number2 = 6
Div = Number1 / Number2 # Division of numbers
print(Div)

1.6666666666666667

In [ ]:
Number1 = 10
Number2 = 6
Floor_div = Number1 // Number2 # Floor division of numbers
print(Floor_div)

1

In [ ]:
Number1 = 10
Number2 = 6
Mod = Number1 % Number2 # Modulo of numbers
print(Mod)

4

In [ ]:
Number1 = 10
Number2 = 6
Exp = Number1 ** Number2 # Exponentiation of numbers
print(Exp)

1000000

In [210]:
## Example 1
variable1=100
variable2=90
sum=variable1+variable2
sub=variable1-variable2
mul=variable1*variable2
div=variable1/variable2
print("The sum of variables is:",sum)
print("The subraction of variables is:",sub)
print("The multiplication of variables is:",mul)
print("The division of variables is:",div)

The sum of variables is: 190
The subraction of variables is: 10
The multiplication of variables is: 9000
The division of variables is: 1.1111111111111112

In [211]:
## Example 2
num1=76.90
num2=56.88
sum=num1+num2
sub=num1-num2
mul=num1*num2
div=num1/num2
Floor_div =num1//num2
Mod=num1 % num2
Exp=num1 **num2 
print("The sum of variables is:",sum)
print("The subraction of variables is:",sub)
print("The multiplication of variables is:",mul)
print("The division of variables is:",div)
print("The floor division of variables is:",Floor_div)
print("The modulus of variables is:",Mod)
print("The exponent of variables is:",Exp)

The sum of variables is: 133.78
The subraction of variables is: 20.020000000000003
The multiplication of variables is: 4374.072
The division of variables is: 1.3519690576652603
The floor division of variables is: 1.0
The modulus of variables is: 20.020000000000003
The exponent of variables is: 1.868487547747309e+107

## 3.2. Comparison operators
* Comparison operators are used to compare the two values either string or a number and return the result True or False depend upon the condition.

**_Example 1_**
* These examples include Comparision of **numbers**
* The comparision operators use to check some common conditions on string or numbers including **<,>,<=,>=,==,!=**

In [ ]:
value1 = 10
value2 = 6
result = value1 < value2
print(result)

False

In [ ]:
value1 = 10
value2 = 6
result = value1 > value2
print(result)

True

In [ ]:
value1 = 10
value2 = 6
result = value1 == value2
print(result)

False

In [ ]:
value1 = 10
value2 = 6
result = value1 != value2
print(result)

True

In [ ]:
value1 = 10
value2 = 6
result = value1 <= value2
print(result)

False

In [ ]:
value1 = 10
value2 = 6
result = value1 >= value2
print(result)

True

**_Example 2_**
* These examples include Comparision of **Strings**
* The comparision operators use to check some common conditions on string or numbers including **<,>,<=,>=,==,!=**

In [ ]:
String1 = "Tahir"
String2 = "Bilal"
result = String1 == String2
print(result)

False

In [ ]:
String1 = "Tahir"
String2 = "Bilal"
result = String1 != String2
print(result)

True

## 3.3. Logical operators
* Logical operators are used to combine the multiple conditions.
* **AND, OR, NOT** operators are logical

**_Examples_**
* The logical operators use to check multiple conditions by using **AND, OR, NOT**

In [ ]:
value1 = 10
value2 = 6
result = value1 <= value2 and Value1 ==10
print(result)

False

In [ ]:
value1 = 10
value2 = 6
result = value1 <= 11 or Value2 >=11
print(result)

True

In [ ]:
value1 = 10
value2 = 6
result = (not(value1 <= value2 and Value1>=10))
print(result)

True

## 3.4. Assignment operators
* Assignment operators are used simply assign the values to a variables.

**_Examples_**
* These are the folllowing examples of assignment operatores.

In [ ]:
value = 5

print(value)

5

In [ ]:
value = 10
value += 6
print(value)

16

In [ ]:
value = 10
value -= 6
print(value)

4

In [ ]:
value = 10
value *= 6
print(value)

60

In [ ]:
value = 10
value /= 6
print(value)

1.6666666666666667

In [ ]:
value = 10
value %= 6
print(value)

4

In [ ]:
value = 10
value //= 6
print(value)

1

In [ ]:
value = 10
value **= 6
print(value)

1000000

In [ ]:
value = 10
value &= 6
print(value)

2

In [ ]:
value = 10
value |= 6
print(value)

14

In [ ]:
value = 10
value >>= 6
print(value)

0

In [ ]:
value = 10
value <<= 6
print(value)

640

In [220]:
## Example 1
a=90
print("The value of a is:",a)
a+=10
print("The value of a is:",a)
a-=10
print("The value of a is:",a)
a*=10
print("The value of a is:",a)
a/=10
print("The value of a is:",a)
a%=10
print("The value of a is:",a)
## Redefinition of a variable
a=500
a//=10
print("The value of a is:",a)
a**10
print("The value of a is:",a)

The value of a is: 90
The value of a is: 100
The value of a is: 90
The value of a is: 900
The value of a is: 90.0
The value of a is: 0.0
The value of a is: 50
The value of a is: 50

In [229]:
## Example 2
x=50
x&=8
print("The bitwise AND results in:",x)
x|=8
print("The bitwise OR results in:",x)
x>>=8
print("The right shift results in:",x)
x<<=2
print("The left shift results in:",x)

The bitwise AND results in: 0
The bitwise OR results in: 8
The right shift results in: 0
The left shift results in: 0

# 4. Conditional Statements
* If-else control statements are used based on the conditions to execute the blocks of a program.
* These are the following conditional statements
  * if statement
  * if-else statement
  * if-else-statement
  
## 4.1. if Statement
* It check the conditions and run blocks of code

**_Examples_**
* The example of **if** statement is as follows

In [ ]:
Value1 = 33
value2 = 100
if value2 > value1:
    print("value2 is greater than value1")

value2 is greater than value1

## 4.2. if-else Statement
* It also check the conditions and run blocks of code
* if condition is true it runs the blcok otherwise move to else block

**_Example_**
* The example of **if-else** statement is as follows

In [ ]:
value1 = 200
value2 = 33
if value2 > value1:
    print("True")
else:
    print("False")

False

## 4.3. if-else-if Statement (Elif)
* It also check the multiple conditions and run blocks of code
* **Elif** when if conditions were not true, then try this condition
* if condition is true it runs the blcok otherwise move to else block then move to if block

**_Example_**
* The example of **Elif** statement is as follows

In [ ]:
value1 = 200
value2 = 33
if value2 > value1:
    print("True")
elif value1 == value2:
    print("True")
else:
    print("False")

False

In [231]:
## Example 1
var=7
if var>0:
    print("It is a positive number!")
elif var<0:
    print("It is a negative number!")
else:
    print("The number is zero!")

It is a positive number!

In [230]:
## Example 2
num=6
if num%2==0:
    print("This is even number")
else:
    print("This is odd number")

This is even number

# 5. Loops
* A loop allows us to run a statement or condition multiple times.
* These are the following loops given below
  * **For** Loop
  * **While** Loop
  * **Nested** Loop
  
## 5.1 For Loop
* For loop is itterative

**_Examples_**
* The example of **For** loop is as follows
* Print all values in stored in varialbe name

In [ ]:
Name = ["Tahir", "waqas", "Bilal"]
for x in Name:
    print(x)

waqar
waqas
Bilal

## 5.2 Break statement
* It is used to stop the loop

**_Examples_**
* The example of **Break** statement is as follows

In [ ]:
Name = ["Tahir", "waqas", "Bilal"]
for x in Name:
    print(x)
    if x == "waqas":
        break

waqar
waqas

## 5.3 Continue statement
* It is used to stop the current itteration of a loop

**_Examples_**
* The example of **Break** statement is as follows

In [ ]:
Name = ["Tahir", "waqas", "Bilal"]
for x in Name:
    if x == "Tahir":
        continue
        print(x)

In [ ]:
for x in 'Python':
      if (x == 'y'):
        continue
        print(x)

## 5.4 While Loop
* It exceute the code until the condition is statisfied

**_Example_**
* The example of **While** Loop is as follows

In [ ]:
value_count = 0
while (value_count < 3):
    value_count = value_count + 1
    print("Machine Learning")

Machine Learning
Machine Learning
Machine Learning

**_Example_**
* The example of **While loop and else** is as follows

In [ ]:
value_count = 0
while (value_count < 3):
    value_count = value_count + 1
    print("Machine Learning")
else:
    print("In Else Block")

Machine Learning
Machine Learning
Machine Learning
In Else Block

## 5.5 Nested Loop
*  Loops indise loops

**_Example_**
* The example of **Nested** Loops is as follows

In [ ]:
Name = ["Tahir", "Waqas", "Bilal"]
DOB = ["1998", "2000", "2002"]
for x in Name:
      for y in DOB:
        print(x, y)

Waqar 1998
Waqar 2000
Waqar 2002
Waqas 1998
Waqas 2000
Waqas 2002
Bilal 1998
Bilal 2000
Bilal 2002

In [ ]:
## Example 1
integers=[5,7,8,2,3,10,65,22]
for x in integers:
    print(x)
    if x==10:
        break

5
7
8
2
3
10

In [ ]:
## Example 2
## Nested loop
for i in range(1,6):
    for j in range(1,6):
        print("*",end=" ")
    print()

* * * * *
* * * * *
* * * * *
* * * * *
* * * * *

# 6. Functions
* Reuseable block of code.
* Some functions are built-in like len(),print() etc...
* Functions created by yourself is called user defined function
* Pass parameters to a function
  
## 6.1 Create a Function
* In Python Function is created using **def** keyword

**_Example_**
* Creation of a function

In [ ]:
def my_function():
    print("Machine Learning")

## 6.2 Calling a Function
* When function is call then it perform its functionality

**_Example_**
* Creation of a function and calling a function

In [ ]:
def my_function():
    print("Machine Learning")

my_function()

Machine Learning

## 6.3 Parameters in a Function
* Any information pass to a function to perform its functionality
* parameter is pass inside the parentheses

**_Example_**
* Creation of a function and calling a function and pass parameter to a function

In [244]:
def my_function(first_name):
  print(first_name + " Sohail")

my_function("Tahir")
my_function("Waqas")
my_function("Bilal")

Tahir Sohail
Waqas Sohail
Bilal Sohail

## 6.4 Defeault parameter in a Function
* when we call the function without parameter the pass the default parameter

**_Example_**
* Creation of a function and calling a function and pass parameter as default parameter

In [245]:
def my_function(first_name="waqas"):
  print(first_name + " Sohail")

my_function("Tahir")
my_function()
my_function("Bilal")

Tahir Sohail
waqas Sohail
Bilal Sohail

  ## 6.5 Return in a Function
* Return keyword is used to return the value

**_Example_**
* Creation of a function and calling a function and pass parameter to a function and return the value

In [ ]:
def my_function(value):
    return 5 * value

print(my_function(2))
print(my_function(4))
print(my_function(8))

10
20
40

In [253]:
## Example 1
def add_function(num1,num2):
    return num1+num2
def sub_function(num1,num2):
    return num1-num2
def mul_function(num1,num2):
    return num1*num2

print("The addition of these numbers are:",add_function(100,66))
print("The subraction of these numbers are:",sub_function(100,66))
print("The multiplication of these numbers are:",mul_function(100,66))

The addition of these numbers are: 166
The subraction of these numbers are: 34
The multiplication of these numbers are: 6600

In [252]:
## Example 2
def student_ID(ID_code):
    print("F2023266"+ID_code)

student_ID("1130")
student_ID("1131")
student_ID("1132")
student_ID("1133")

F20232661130
F20232661131
F20232661132
F20232661133

# 7. Lambda Function
* Small anonymous function created at runtime.
* Function created using the keyword callled **Lambda**
* Take multiple arguments but sinle having only one expression
* It doesn't include return statement
* It returns always a expression

## 7.1 Lambda Function syntax
* lambda arguments : expression

**_Example 1_**
* This example shows the basic syntax of a Lambda Function

In [ ]:
add = lambda value : value + 10
print(add(5))

15

**_Example 2_**
* This example shows the multiple arguments and single expression

In [ ]:
mul = lambda value1, value2 : value1 * value2
print(mul(5, 6))

30

## 7.2 Map()
* it takes two arguments like: r = map(my_function, my_seqeuence)
* The first argument in r = map(my_function, my_seqeuence) function name and second is sequence name (e.g. a list).

**_Example_**
* my_sequence map() apply to the function my_function to all the elements of the my_sequence.
* New list is returned that all the elements changed by the my_function

In [ ]:
my_sentence = 'Machine learning is a interesting course'
sentence_words = my_sentence.split()
print (sentence_words)
words_length = map(lambda words: len(words), sentence_words)
list(words_length)

['Machine', 'learning', 'is', 'a', 'interesting', 'course']

[7, 8, 2, 1, 11, 6]

## 7.2 Filter()
* There are two arguments of a Filter() method
* Filter(my_function, my_list) method filter the values of a list.
* Filter(my_function,l) method take one argument as parameter and my_function returns a Boolean value True/False.
* This Method will be applied to every element of the list l only when my_function returns True value.

**_Examples_**

* The examples of Filter() method is given below

In [ ]:
my_list = [0,2,2,2,3,6,9,14,23,34,57]
result = filter(lambda value: value % 2, my_list)
list(result)

[3, 9, 23, 57]

In [ ]:
my_list = [0,2,2,2,3,6,9,14,23,34,57]
result1 = filter(lambda value: value % 2 ==0, my_list)
list(result1)

[0, 2, 2, 2, 6, 14, 34]

In [4]:
## Example 1
numbers = [1, 2, 3, 4, 5]
squared = list(map(lambda x: x ** 2, numbers))
print("The squares of the numbers are:",squared)

The squares of the numbers are: [1, 4, 9, 16, 25]

In [3]:
## Example 2
numbers = [1, 2, 3, 4, 5, 6]
greater_than_three = list(filter(lambda x: x > 3, numbers))
print("The elements greater than three are:",greater_than_three)

The elements greater than three are: [4, 5, 6]

## 10.4. Why, When and Where Lambda Function is used?

**Why?**
* Beccause its provide a facility to declare small anonymous functions.

**When?**
* Code reuseability
* Conciseness and the reduction in code bloat

**Where?**
* Use in built-in methods map() and filter().

# 8. Arrays

* Store number of values of same type in a single variable at a time
* Location of values at memory
* Index is start from zero in array

## 8.1 Create, Access and Update Array

**_Examples_**

* The following example shows How to **Create** an array and print

In [254]:
Array_information = ["Tahir", "Sohail", "COMSATS"]
print(Array_information)

['Tahir', 'Sohail', 'COMSATS']

**_Example_**

* The following example shows How to **Access** an array value and print

In [255]:
Array_information = ["Tahir", "Sohail", "COMSATS"]
print("Complete Array", Array_information)
value = Array_information[0]
print("Array value at index 0:",value)

Complete Array ['Tahir', 'Sohail', 'COMSATS']
Array value at index 0: Tahir

**_Example_**

* The following example shows How to **Modify** an array value and print

In [ ]:
Array_information = ["Tahir", "Sohail", "COMSATS"]
print("Array before update", Array_information)
Array_information[0] = "Bilal"
print("Array After update", Array_information)

Array before update ['Waqar', 'Ashiq', 'COMSATS']
Array After update ['Bilal', 'Ashiq', 'COMSATS']

**_Example_**

* The following example shows **Length** of an array and print

In [261]:
Array_information = ["Tahir", "Sohail", "COMSATS"]
print("Complete Array", Array_information)
value = len(Array_information)
print("Total Array length is:",value)

Complete Array ['Tahir', 'Sohail', 'COMSATS']
Total Array length is: 3

In [260]:
## Example 1
array=["Red","Orange","Yellow","Blue","Green"]
print("The name of multiple colors:",array)
## Updating the first index of the array
print("printing array after updating:")
array[1]="Sea Green"
print("The name of multiple colors:",array)
val=len(array)
print("lenght of array is:",val)

The name of multiple colors: ['Red', 'Orange', 'Yellow', 'Blue', 'Green']
printing array after updating:
The name of multiple colors: ['Red', 'Sea Green', 'Yellow', 'Blue', 'Green']
lenght of array is: 5

In [264]:
## Example 2
array_int=[1,2,3,4,5,6,7,8,9,10]
print("The values of integers:",array_int)
## Updating the first index of the array
print("printing array after updating:")
array_int[5]=67
print("The values of integers:",array_int)
length=len(array_int)
print("lenght of array is:",length)

The values of integers: [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
printing array after updating:
The values of integers: [1, 2, 3, 4, 5, 67, 7, 8, 9, 10]
lenght of array is: 10

# 9. Classes and Objects

* Classes are a template to create objects.
* Everything in Python is an Object, because its object oriented language.
* Object is the instance (variable and function) of a class

## 9.1 Create Class and Object

**Example**
* Create a class with name, **my_class**
* Property of class is **value**

In [ ]:
class my_class:
    value = 10
    print(value)

10

**Example**

* Create an object of a class **my_class**

In [ ]:
class_object = my_class()
print(class_object.value)

10

In [273]:
## Example 1
class student:
    Name="Amna Miraj"
    ID="F20232661130"
Student1=student()
print("The name of the student is:",Student1.Name)
print("The ID of the student is:",Student1.ID)

The name of the student is: Amna Miraj
The ID of the student is: F20232661130

In [272]:
## Example 2
class car:
    car_name="Mercedes"
    car_color="Black"
Car=car()
print("The name of the car is:",Car.car_name)
print("The color name is:",Car.car_color)

The name of the car is: Mercedes
The color name is: Black

# 10. File I/O
* Python has number of functions for File I/O
* creating, reading, updating, and deleting files methods are used.

## 10.1 Reading input from Keyboard
* **raw_input()** method is used to read input from keyboard.
* Reads sinle line from standard input
* It returns the input as string

**_Example_**
* This example takes input from user

In [ ]:
from six.moves import input
user_input_string = input("Enter your name: ");
print(user_input_string)

Enter your name: Waqar Ashiq
Waqar Ashiq

## 10.2 I/O from Text File
* **Open()** Method is used to open the file
* **Open()** Method takes two parameters first is the name of file, and second is file mode.
* There are multiple modes or methods to handle the file given below
  * **"x"** Create - Creates a new file, give error if exists already
  * **"r"** Read : Default value opens for reading.
  * **"w"** Write mode only.
  * **"a"** Append mode
  * **"r+"** Read and write mode.
  * **"a+"** Append and read mode.
  * **"t"** Text - Default value. Text mode
  * **"b"** Binary - Binary mode
  
### 10.2.1 Create a Text File
* **"x"** Creates a new file, give error if exists already

**_Example_**

* This example will show the file creation

In [ ]:
my_file = open("My_personal_file.txt", "x")

### 10.2.2 Read a Text File
* **"r"** mode is used to read the file

**_Example_**

* This example will show the file information

In [ ]:
my_file = open("My_personal_file.txt", "r")
information=my_file.read()
print(information)

Name:
        Waqar Ashiq
Registeration No.:
        CUI/SP19-RCS-013/LHR
Assignment:
        Machine Learning

**_Example 2_**

* This example will show the line one of file using **readline()** method

In [ ]:
my_file = open("My_personal_file.txt", "r")
information=my_file.readline()
print(information)

Name:

### 10.2.3 Write into a Text File
* **"w+"** mode is used to write in to the file

**_Example_**

* This example will show the information write into the file and display the updated information

In [ ]:
my_file = open("My_personal_file.txt", "a+")
my_file = my_file.write("University: COMSATS Lahore")

my_file = open("My_personal_file.txt", "r+")
information=my_file.read()
print(information)

Name:
        Waqar Ashiq
Registeration No.:
        CUI/SP19-RCS-013/LHR
Assignment:
        Machine Learning University: COMSATS Lahore

## 10.3 File Position
* There are multiple methods to check the position of a file and to change the location of a file
* **tell()** method used to show currenct position within the file.
* **seek()** method is used to change the location of a file.

In [294]:
my_file = open("My_personal_file.txt", "r+")
string = my_file.read(10);
print ("Reading String is : \n", string)

# Check current position

current_position = my_file.tell();
print ("Current position of the file is: \n", current_position)

# Reposition pointer at the beginning once again

current_position = my_file.seek(0, 0);
string = my_file.read(10);
print ("Again reading String is : \n", string)

FileNotFoundError: [Errno 2] No such file or directory: 'My_personal_file.txt'

In [277]:
## Example 1
string = input("Enter your university name: ");
print("My university name is",string)

My university name is UMT

In [2]:
## Example 2
file=open("student_file.txt","x")

In [3]:
file=open("student_file.txt","w")
info=file.write("Name: Amna Miraj ")
info=file.write("Student ID: F20232661130 ")
info=file.write("University Name: UMT ")

In [4]:
file=open("student_file.txt","r")
information=file.read()
print(information)

Name: Amna Miraj Student ID: F20232661130 University Name: UMT

In [5]:
current_position =file.tell();
print ("Current position of the file is: \n", current_position)
current_position =file.seek(0,0);
print ("Current position of the file is: \n", current_position)

Current position of the file is:
 63
Current position of the file is:
 0

## 10.4. Why, When and Where File I/O is used?

**Why?**
* Beccause its used to store data permanently in a hard disk
* Data is lost in Ram so its File is used to store data in ROM

**When?**
* When data is large and not stored in RAM

**Where?**
* Where data is stored for long term use
* For future use of daata File is created

## 11. Pandas Introduction
* Pandas is an open source data analysis library
* It read the .CSV format file
* There are two data structures of Pandas given below
  * Series (1-dimensional)
  * DataFrame (2-dimensional)
* Pandas build on the top of Numpy library
* Automatically allign the data
* Easily reshape the dataset in Pandas

## 11.1 Read the Dataset using Pandas
* The following code read the dataset in Csv format and dispay

In [1]:
import pandas as pd
print("\n Dataset: \n")
data = pd.read_csv('My_dataset.csv')
data.head(8)

 Dataset:

,text,selected_text,sentiment
0,"I`d have responded, if I were going","I`d have responded, if I were going",neutral
1,Sooo SAD I will miss you here in San Diego!!!,Sooo SAD,negative
2,my boss is bullying me...,bullying me,negative
3,what interview! leave me alone,leave me alone,negative
4,"Sons of ****, why couldn`t they put them on t...","Sons of ****,",negative
5,http://www.dothebouncy.com/smf - some shameles...,http://www.dothebouncy.com/smf - some shameles...,neutral
6,2am feedings for the baby are fun when he is a...,fun,positive
7,Soooo high,Soooo high,neutral

In [ ]:
data.shape

(30000, 2)

In [ ]:
data.Sentiment.value_counts()

worry         7433
neutral       6340
sadness       4828
happiness     2986
love          2068
surprise      1613
hate          1187
fun           1088
relief        1021
empty          659
enthusiasm     522
boredom        157
anger           98
Name: Sentiment, dtype: int64

In [6]:
## Example 1
import pandas as pd
data=pd.read_csv('My_dataset.csv')
data.head(5)

,text,selected_text,sentiment
0,"I`d have responded, if I were going","I`d have responded, if I were going",neutral
1,Sooo SAD I will miss you here in San Diego!!!,Sooo SAD,negative
2,my boss is bullying me...,bullying me,negative
3,what interview! leave me alone,leave me alone,negative
4,"Sons of ****, why couldn`t they put them on t...","Sons of ****,",negative

In [7]:
data.shape

(27481, 3)

In [8]:
data.sentiment.value_counts()

sentiment
neutral     11118
positive     8582
negative     7781
Name: count, dtype: int64

## 11.2. Why, When and Where Pandas used?

**Why:**
* Tool for data minning
* Pandas consists of high-level data structures and data analysis tools
* Pandas is designed for quick data analysis

**When:**
* When there is large ammount of data to handle and pandas used for data manipulation and data analysis
* To handle big data
* When we want to read data in Csv format
* To handle the dataframes in python
* Used for merging and joining
* Used to reshape the datasets
* Data Alignment and handle the missing data
* Functionality of Time series
* Slicing and subsetting of data

**Where:**
* Most widely used in Data Science
* Data Modeling
* High performance systems

## 12. Series  
* Much similar to NumPy array.
* Series is 1-D array labeled array
* Series capable to hold any kind of data type.
* series is indexed by a label its the major differnce with Numpy array
* Index in a series are
* Axis labels is a series are the index.

## 12.1 Create a series

* The syntax for creating a series is as follows given below
* myseries= pd.Series(data,index = index)
  * In above syntax include following thinds:
  * Python dict
  * ndarray
  * Scalar value e.g. 5
  
**Example**

* This will create a series from pandas of a given information

In [300]:
import pandas as pd
import numpy as np

array_data = np.array(['l','m','n','o','p'])
my_series = pd.Series(array_data)
print(my_series)

0    l
1    m
2    n
3    o
4    p
dtype: object

## 12.2 From ndarray
* When data is narray, the length of the index and data is same.  
* If no index is passed then it will be created from the following values
  * Values [0, ..., len(data) - 1].

**_Example_**

* This will create a series from pandas of a given information.
* Data information includes 5 random values and indexes are assigned from a-e

In [ ]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

myseries = pd.Series(np.random.randn(5), index=['l','m','n','o','p'])
print(myseries)

l   -0.653020
m   -0.145922
n   -1.226343
o    0.064902
p    0.217702
dtype: float64

**_Example_**

* **.index** is used to print the index of array and its datatype

In [ ]:
myseries.index

Index(['l', 'm', 'n', 'o', 'p'], dtype='object')

**_Example_**

* if we can't create a array of indexs then the length of index values will be **[0......len(data-1)]**

In [ ]:
pd.Series(np.random.randn(10))

0    0.496761
1   -0.377681
2    0.570217
3   -1.036331
4    0.703891
5    0.548018
6   -0.357430
7    0.806675
8   -0.474379
9    0.645977
dtype: float64

## 12.3 From dict

* when information is dict and index is passed
* The values corresponding to the labels in the index will be pulled out
* when there is no index is passed then
  * it will create from dict with keys that are sorted, if possible

**_Example_**

* In following example, no indexes are given
* Its build from the keys of a dict which are sorted

In [ ]:
my_dict = {'l' : 0., 'm' : 1., 'n' : 2., 'o' : 3.,'p' : 4.} # a python dict
pd.Series(my_dict)

l    0.0
m    1.0
n    2.0
o    3.0
p    4.0
dtype: float64

**_Example_**
* In this example, index are given
* So values are displayed equivalent to index that will be pulled out

In [ ]:
pd.Series(my_dict, index=['l', 'm', 'n', 'o', 'p','q'])

l    0.0
m    1.0
n    2.0
o    3.0
p    4.0
q    NaN
dtype: float64

## 12.4 From a scalar value
* Index must be given in scalar data. The value will be repeated to match the length of index
* To match the length of the string values will be repeated

**_Example_**

* In this example, scalar data is given To match the length of the string values will be repeated

In [ ]:
pd.Series(5., index=['l', 'm', 'n', 'o', 'p'])

l    5.0
m    5.0
n    5.0
o    5.0
p    5.0
dtype: float64

## 12.5 Series is ndarray-like

* Acts like much similar to ndarray.
* Valid argumen in Numpy function
* However, slice the indexes.

**_Example_**
* Access the value like ndarray
* Access single value

In [ ]:
myseries[0]

-0.6530203170865407

**_Example_**

* In the following example, we can Access range of values

In [ ]:
myseries[:5]

l   -0.653020
m   -0.145922
n   -1.226343
o    0.064902
p    0.217702
dtype: float64

**_Example_**

* This eaxmple will return the range of values in series
* Reutrn those values whose series value is greater than the median of series value

In [ ]:
myseries[myseries > myseries.median()]

o    0.064902
p    0.217702
dtype: float64

**_Example_**

* Following example is return the values in series with indexes
* 3,2,0 represents the positions of a indexs
* e.g. the index at 3,2,0 are o,n,l respectively

In [ ]:
myseries[[3, 2, 0]]

o    0.064902
n   -1.226343
l   -0.653020
dtype: float64

**_Example_**
* This example will returns the exponent values
* Like e^o, here o is index and its respective data

In [ ]:
np.exp(myseries)

l    0.520471
m    0.864225
n    0.293364
o    1.067055
p    1.243216
dtype: float64

**_Example_**

* This example will return the data of specific given index

In [ ]:
myseries['n']

-1.2263426276652036

**_Example_**
* Following example will update the data of the given index
* Before updating 0=-0.552224 but after updating e = 12.000000

In [ ]:
myseries['o'] = 12.
myseries

l    -0.653020
m    -0.145922
n    -1.226343
o    12.000000
p     0.217702
dtype: float64

**_Example_**
* Following will return true if 'm exists' in a indexes otherwise it returns false

In [ ]:
'm' in myseries

True

**_Example_**

* This will create error in 'n' not exist in series.

In [ ]:
myseries['n']

-1.2263426276652036

**_Example_**
* Using the get() method, no existing label will return nothing

In [ ]:
myseries.get('s') #it will return none

In [ ]:
myseries.get('m', np.nan) #it will return default value

-0.14592179609047692

## 12.7 Vectorized operations and label alignment with Series

* In data analysis,by using NumPy arrays it is not required to get Series values through looping
* Series data can be passed into most NumPy methods
* series is not passed into  an ndarray.

**_Example_**

* Following example will add the data of series with series, of equivalent indexes and print the result

In [ ]:
l = myseries['l'] + myseries['l']
m = myseries['m'] + myseries['m']
n = myseries['n'] + myseries['n']
o = myseries['o'] + myseries['o']
p = myseries['p'] + myseries['p']

Total=myseries+myseries
print(Total)

l    -1.306041
m    -0.291844
n    -2.452685
o    24.000000
p     0.435403
dtype: float64

**_Example_**

* Following example will multiply the series indexes values with 2 and print the result

In [ ]:

l = myseries['l'] * 2
m = myseries['m'] * 2
n = myseries['n'] * 2
o = myseries['o'] * 2
p = myseries['p'] * 2

result=myseries * 2
print(result)

l    -1.498539
m     3.246002
n    -1.534587
o    24.000000
p     1.254392
dtype: float64

In [ ]:
myseries = pd.Series(np.random.randn(5), name='Nothing')
print(myseries)

0   -0.655625
1    0.942512
2   -0.332767
3    0.590877
4   -0.208293
Name: Nothing, dtype: float64

In [ ]:
myseries.name #print the name attribute of series

'Nothing'

In [10]:
## Example 1
import pandas as pd

In [11]:
s=pd.Series([1,2,3,4,5,6],index=['a','b','c','d','e','f'])
s

a    1
b    2
c    3
d    4
e    5
f    6
dtype: int64

In [12]:
s4 = pd.Series(["Ali", 21, 85.5, True], index=["Name", "Age", "Marks", "Passed"])
print(s4)

Name       Ali
Age         21
Marks     85.5
Passed    True
dtype: object

In [13]:
import pandas as pd
values = pd.Series({'a': 5, 'b': 10, 'c': 15, 'd': 20, 'e': 25})
double_a = values['a'] * 2
double_b = values['b'] * 2
double_c = values['c'] * 2
double_d = values['d'] * 2
double_e = values['e'] * 2
double_values = values * 2
print("Manual Doubling of Each Value:")
print(f"a: {double_a}, b: {double_b}, c: {double_c}, d: {double_d}, e: {double_e}")
print("\nDoubling All Values at Once:")
print(double_values)

Manual Doubling of Each Value:
a: 10, b: 20, c: 30, d: 40, e: 50

Doubling All Values at Once:
a    10
b    20
c    30
d    40
e    50
dtype: int64

## 12.8 Why, When and Where series is used?

**Why?**
* series is aone-dimensional array
* Series is used to handle and manipulate date
* Used to perform mathematical operations
* Requires a less memory space

**WHen?**

* When you need to store data in the form to tables
* When you need to predict values based on previous information
* When the size of data is large and stored in the form of tables for analysis
* When you perform analisys on Weather predition analysis, stock price analysis

**Where?**

* Mostly used for the non-stationary data
* Mostly used in Data science
* Used in Machine learning algorithms for data analysis
* Used in Prediction systems

## 13. Data Frames

* Data Frames is a data structure with axes (rows and columns) which are labeled.
* Its a two-dimensional size mutable
* Data is represented in a tabular form in rows and columns.
* DataFrame includes three basic components
  * The data
  * Rows, and columns.
* Like Series, DataFrame accepts many several types of inputs
* Dataframe can be created using
  * ndarrays
  * lists
  * dicts
  * Series
* By calling the column name we can access the column in dataframe to slect the column
* The main purpose of indexing is to slect the particular rows and columns data from the dataframe
* Data Frame contains rows and columns so, if you want to iterate over dataframe, you must have to iterate the dataframe just like an dictionary.


## 13.1 From dict of Series or dicts

* The resultant index is the union of the indexes in a Series.
* when dicts are nested, then it must convert into the series.
* when there is no column is pass, the columns will be the sorted list of dict keys

**_Example_**

* Create Dict
* Create a dataframe. row label will be the index of a series.
* As the coloum labels are not provides so it will be sorted list of dict values

In [ ]:
import pandas as pd
new_dict = {
'column_one' : pd.Series([1., 2., 3.], index=['l', 'm', 'n']),
'column_two' : pd.Series([1., 2., 3., 4.], index=['l', 'm', 'n', 'o'])
}
dataframe = pd.DataFrame(new_dict)
print(dataframe)

   column_one  column_two
l         1.0         1.0
m         2.0         2.0
n         3.0         3.0
o         NaN         4.0

**_Example_**
* In the following example Data frame will be created for given row labels o, m, l

In [ ]:

pd.DataFrame(new_dict, index=['o', 'm', 'l'])

   column_one  column_two
o         NaN         4.0
m         2.0         2.0
l         1.0         1.0

**_Example_**
* Following example will display a data frame when we give coloumn names

In [ ]:
pd.DataFrame(new_dict, index=['o', 'm', 'l'], columns=['column_two', 'Three'])

   column_two Three
o         4.0   NaN
m         2.0   NaN
l         1.0   NaN

In [ ]:
dataframe.columns

Index(['column_one', 'column_two'], dtype='object')

## 13.2 From dict of ndarrays / lists

* The length of all ndarry must be same.
* length is same as arrays when index is passed
* Result will be range(m), where m is the array length when index is not passed.

**_Example_**

* Following examples shows that ndarray having the lengths are same

In [ ]:
my_data = {
'Col_One' : [1., 2., 3., 4.],
'Col_Two' : [4., 3., 2., 1.]
}

pd.DataFrame(my_data)

   Col_One  Col_Two
0      1.0      4.0
1      2.0      3.0
2      3.0      2.0
3      4.0      1.0

**_Example_**
* when indexs are given the length will same of both arrays

In [ ]:
pd.DataFrame(my_data, index=['l', 'm', 'n', 'o'])

   Col_One  Col_Two
l      1.0      4.0
m      2.0      3.0
n      3.0      2.0
o      4.0      1.0

## 13.3 From a list of dicts

**_Example_**

* Creating a DataFrame from list of dicts

In [ ]:
my_data2 = [{'l': 1, 'm': 2}, {'l': 5, 'm': 10, 'n': 20}]
pd.DataFrame(my_data2)

   l   m     n
0  1   2   NaN
1  5  10  20.0

**_Example_**

* In the following example, Passing list of dicts data and indexes as row labels

In [ ]:
pd.DataFrame(my_data2, index=['first_row', 'second_row'])

            l   m     n
first_row   1   2   NaN
second_row  5  10  20.0

**_Example_**

* In this example passing list of dicts as data and columns labels

In [ ]:
pd.DataFrame(my_data2, columns=['l', 'm'])

   l   m
0  1   2
1  5  10

## 13.4 From a dict of tuples

* When you pass an tuples dictionary you can automatically create multi_indexed data frame

**_Example_**

* NaN represents as missing data

In [ ]:
pd.DataFrame({('a', 'b'): {('A', 'B'): 1, ('A', 'C'): 2},
('a', 'a'): {('A', 'C'): 3, ('A', 'B'): 4},
('a', 'c'): {('A', 'B'): 5, ('A', 'C'): 6},
('b', 'a'): {('A', 'C'): 7, ('A', 'B'): 8},
('b', 'b'): {('A', 'D'): 9, ('A', 'B'): 10}})

       a              b
       b    a    c    a     b
A B  1.0  4.0  5.0  8.0  10.0
  C  2.0  3.0  6.0  7.0   NaN
  D  NaN  NaN  NaN  NaN   9.0

## 13.5 Alternate Constructors

* These are the following alternate constructors given below
  * DataFrame.from_dict
  * DataFrame.from_records
  
**DataFrame.from_dict**

* DataFrame.from_dict takes a sequence of dicts values and returns a DataFrame.
* It is just like a DataFrame constructor except for 'columns' parameter
* it can be set to 'index' to use the dict values as row labels.

**DataFrame.from_records**

* DataFrame.from_records takes a list of tuples
* Or its takes an ndarray with any type.

**_Example_**
* Given below an example

In [ ]:
import numpy as np
mydata = np.zeros((2,), dtype=[('A', 'i4'),('B', 'f4'),('C', 'a10')])
print(mydata)

[(0, 0., b'') (0, 0., b'')]

In [ ]:
pd.DataFrame.from_records(mydata, index='C')

     A    B
C
b''  0  0.0
b''  0  0.0

## 13.6 Column selection, addition, deletion

* DataFrame can be worked semantically
* DataFrame is a dict of lindexed Series of the objects
* Column selecting,addition, and deletion columns works as same syntax as the analogous dict operations.

### 13.6.1 Column selection

**_Example_**

* Given below example selects and show data under coloumn 'column_one'

In [ ]:
dataframe['column_one']

l    1.0
m    2.0
n    3.0
o    NaN
Name: column_one, dtype: float64

**_Example_**
*  Assigning values to a column named 'colmun_three' after perform calculation

In [ ]:
dataframe['column_three'] = dataframe['column_one'] * dataframe['column_two']
print(dataframe)

   column_one  column_two  column_three
l         1.0         1.0           1.0
m         2.0         2.0           4.0
n         3.0         3.0           9.0
o         NaN         4.0           NaN

**_Example_**
*  Assigning values to a column named 'colmun_three' after perform calculation
*  check if value of "column_one' is > 2 then assign True otherwise false

In [ ]:
dataframe['flag'] = dataframe['column_one'] > 2
print(dataframe)

   column_one  column_two  column_three   flag
l         1.0         1.0           1.0  False
m         2.0         2.0           4.0  False
n         3.0         3.0           9.0   True
o         NaN         4.0           NaN  False

### 13.6.2 Column Deletion

* Columns can be deleted or popped like with a dict

**_Example_**
* The following example shows Delete 'column_two' from data frame

In [ ]:
del dataframe['column_two']

In [ ]:
three = dataframe.pop('column_three') #pop a complete coloumn 'three' from dataframe

In [ ]:
print(dataframe)

   column_one   flag
l         1.0  False
m         2.0  False
n         3.0   True
o         NaN  False

### 13.6.3 Column Inerstion

* When inserting a scalar value, it means thats fill the comlumn

**_Example_**

* In the following example new coloumn named 'Machine' will be assigned with 'learning'

In [ ]:
dataframe['Machine'] = 'learning'

In [ ]:
print(dataframe)

   column_one   flag   Machine
l         1.0  False  learning
m         2.0  False  learning
n         3.0   True  learning
o         NaN  False  learning

**_Example_**
* When inserting a Series that does not have the same index as the DataFrame
* It will be confirmed to the index of a DataFrames
* In the following example will take values from column_one its give range and create a new column

In [ ]:
dataframe['one_trunc'] = dataframe['column_one'][:2]

In [ ]:
print(dataframe)

   column_one   flag   Machine  one_trunc
l         1.0  False  learning        1.0
m         2.0  False  learning        2.0
n         3.0   True  learning        NaN
o         NaN  False  learning        NaN

**_Example_**
* The new column inserted at the end by default.
* By using insert methods to insert a new column at a particular location

In [ ]:
"""following function has three arguments.
Argument 1: index where new column will be inserted.
Argument 2: Heading or title of a new clomun
Argument 3: copy the vales of specific existing comlun"""

dataframe.insert(1, 'python', dataframe['column_one'])

In [ ]:
print(dataframe)

   column_one  python   flag   Machine  one_trunc
l         1.0     1.0  False  learning        1.0
m         2.0     2.0  False  learning        2.0
n         3.0     3.0   True  learning        NaN
o         NaN     NaN  False  learning        NaN

## 13.7 Indexing / Selection

* Row selection, for example, returns a Series whose index is the columns of the DataFrame:

**_Example_**

* The following example will return labels of a column and row **'l'** values

In [ ]:
dataframe.loc['l']

column_one           1
python               1
flag             False
Machine       learning
one_trunc            1
Name: l, dtype: object

**_Example_**

* The following example  will return the values of a coloumns that is > than 3

In [ ]:
dataframe.iloc[3]

column_one         NaN
python             NaN
flag             False
Machine       learning
one_trunc          NaN
Name: o, dtype: object

## 13.8 Data alignment and arithmetic

* Data alignment between DataFrame objects automatically align
* Data alignment is done on both the columns and rows.
* Resulting column will be the union of the columns and rows.

In [ ]:
dataframe = pd.DataFrame(np.random.randn(10, 4), columns=['A', 'B', 'C', 'D'])

In [ ]:
dataframe2 = pd.DataFrame(np.random.randn(7, 3), columns=['A', 'B', 'C'])

In [ ]:
dataframe + dataframe2 # add values of columns

          A         B         C   D
0 -1.121929  1.744645 -0.863721 NaN
1 -1.089901 -1.961978 -0.113647 NaN
2  2.046469  1.409829 -0.276194 NaN
3  0.164436  0.825876 -4.061967 NaN
4  0.400977 -1.255831  0.628578 NaN
5  0.823784 -0.727144 -0.079637 NaN
6  0.738490 -1.063634 -1.852572 NaN
7       NaN       NaN       NaN NaN
8       NaN       NaN       NaN NaN
9       NaN       NaN       NaN NaN

 **Example:**
* When we apply any operation on the DataFrame and Series, the by default result is the series index allignment based on the columns of the Dataframe.

In [ ]:
dataframe - dataframe.iloc[0]

          A         B         C         D
0  0.000000  0.000000  0.000000  0.000000
1  0.790430 -2.087295  0.747898 -0.989315
2  2.212405  0.135500  0.600998  0.449223
3  1.231922 -1.102885 -1.620103 -0.698399
4  1.664772 -2.528630  1.618770 -0.313366
5  1.588224 -2.048711  1.162802 -1.496273
6  2.070819 -2.663549 -0.161339 -2.108780
7  0.333184 -1.812612  0.450103 -0.807971
8  0.749355 -2.027687  1.311143 -2.287670
9  1.876433  0.392438  1.010123 -1.138007

In [ ]:
dataframe * 5 + 2

          A          B         C         D
0 -5.864636   8.575990 -1.306343  5.525362
1 -1.912483  -1.860483  2.433148  0.578788
2  5.197389   9.253490  1.698646  7.771479
3  0.294976   3.061565 -9.406858  2.033365
4  2.459224  -4.067159  6.787505  3.958533
5  2.076483  -1.667567  4.507668 -1.956003
6  4.489460  -4.741757 -2.113040 -5.018540
7 -4.198717  -0.487072  0.944171  1.485508
8 -2.117863  -1.562444  5.249374 -5.912989
9  3.517529  10.538180  3.744274 -0.164671

In [ ]:
1 / dataframe

           A         B          C           D
0  -0.635757  0.760342  -1.512245    1.418294
1  -1.277961 -1.295175  11.543401   -3.518123
2   1.563776  0.689323 -16.591787    0.866329
3  -2.932510  4.710028  -0.438333  149.856635
4  10.887937 -0.824109   1.044385    2.552931
5  65.373585 -1.363302   1.993884   -1.263902
6   2.008467 -0.741646  -1.215646   -0.712399
7  -0.806619 -2.010396  -4.735617   -9.718323
8  -1.214222 -1.403531   1.538758   -0.631872
9   3.294831  0.585605   2.866523   -2.309819

In [ ]:
dataframe ** 4

              A         B          C             D
0  6.121171e+00  2.992020   0.191210  2.471354e-01
1  3.749126e-01  0.355375   0.000056  6.527634e-03
2  1.672252e-01  4.429023   0.000013  1.775286e+00
3  1.352202e-02  0.002032  27.088449  1.982878e-09
4  7.115699e-05  2.168011   0.840537  2.354202e-02
5  5.475084e-08  0.289489   0.063270  3.918738e-01
6  6.145269e-02  3.305312   0.457901  3.882461e+00
7  2.362257e+00  0.061217   0.001988  1.121075e-04
8  4.600528e-01  0.257699   0.178369  6.273101e+00
9  8.485306e-03  8.503178   0.014811  3.513079e-02

**Boolean operators work as well:**

In [ ]:
dataframe1 = pd.DataFrame({'a' : [1, 0, 1], 'b' : [0, 1, 1] }, dtype=bool)

In [ ]:
dataframe2 = pd.DataFrame({'a' : [0, 1, 1], 'b' : [1, 1, 0] }, dtype=bool)

In [ ]:
pd.DataFrame({'a' : [0, 1, 1], 'b' : [1, 1, 0] }, dtype=bool)

       a      b
0  False   True
1   True   True
2   True  False

**Example**
* AND **&** logical operator

In [ ]:
dataframe1 & dataframe2

       a      b
0  False  False
1  False   True
2   True  False

**Example**
* OR **|** logical operator

In [ ]:
dataframe1 | dataframe2

      a     b
0  True  True
1  True  True
2  True  True

In [ ]:
-dataframe1

       a      b
0  False   True
1   True  False
2  False  False

## 13.9 Transposing
* T attribute must be access for the transposing
* T also called the transpose function  its much similar to an ndarray

**Example**
* Display the first 5 rows

In [ ]:
dataframe[:5].T

          0         1         2         3         4
A -1.572927 -0.782497  0.639478 -0.341005  0.091845
B  1.315198 -0.772097  1.450698  0.212313 -1.213432
C -0.661269  0.086630 -0.060271 -2.281372  0.957501
D  0.705072 -0.284242  1.154296  0.006673  0.391707

**Example**
* Creating a DataFrame by passing a numpy array
* Index is date time

In [ ]:
date_time = pd.date_range('20190101', periods=6)

In [ ]:
print(date_time)

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06'],
              dtype='datetime64[ns]', freq='D')

In [ ]:
dataframe = pd.DataFrame(np.random.randn(6,4), index=date_time, columns=list('ABCD'))

In [ ]:
print(dataframe)

                   A         B         C         D
2019-01-01  0.750605 -0.069523 -0.998938 -0.362319
2019-01-02 -0.346780  1.159567 -1.323603 -0.181600
2019-01-03  0.857102  0.662322 -0.955811  0.866493
2019-01-04 -0.634592 -1.675086 -0.350006  1.240305
2019-01-05 -1.103729 -0.123992 -0.151002 -1.066669
2019-01-06 -0.092746 -0.536141 -0.094074 -0.544467

**_Example_**
* In the following example DataFrame creation by passing a dict of objects
* That can be converted to series-like.

In [ ]:
dataframe2 = pd.DataFrame({ 'A' : 1.,
'B' : pd.Timestamp('20190102'),
'C' : pd.Series(1,index=list(range(4)),dtype='float32'),
'D' : np.array([3] * 4,dtype='int32'),
'E' : pd.Categorical(["test","train","test","train"]),
'F' : 'Python' })

In [ ]:
print(dataframe2)

     A          B    C  D      E       F
0  1.0 2019-01-02  1.0  3   test  Python
1  1.0 2019-01-02  1.0  3  train  Python
2  1.0 2019-01-02  1.0  3   test  Python
3  1.0 2019-01-02  1.0  3  train  Python

**_Example_**
* In the following example print the specific dtypes

In [ ]:
dataframe2.dtypes

A           float64
B    datetime64[ns]
C           float32
D             int32
E          category
F            object
dtype: object

In [13]:
## Example 1
df=pd.DataFrame({"Names":["Amna","Fatima","Ali"],"Marks":[100,60,40]})
df

    Names  Marks
0    Amna    100
1  Fatima     60
2     Ali     40

In [ ]:
## Example 2
df5 = pd.DataFrame({
    "Person": ["Ali", "Fatima", "Hassan", "Noor"],
    "City": pd.Categorical(["Lahore", "Karachi", "Islamabad", "Lahore"]),
    "Employed": [True, False, True, False]
})

print(df5)

   Person       City  Employed
0     Ali     Lahore      True
1  Fatima    Karachi     False
2  Hassan  Islamabad      True
3    Noor     Lahore     False

In [9]:
print(df5.loc["Fatima"])

City        Karachi
Employed      False
Name: Fatima, dtype: object

In [ ]:
## Example 3
import pandas as pd
import numpy as np
dataframe2 = pd.DataFrame({
    'X': 5.5,  
    'Y': pd.Timestamp('20240328'),  
    'Z': pd.Series([10, 20, 30, 40], dtype='float32'),  
    'W': np.array([7] * 4, dtype='int32'),  
    'Category': pd.Categorical(["apple", "banana", "apple", "banana"]),  
    'Language': 'JavaScript'  
})

In [3]:
print(dataframe2)

     X          Y     Z  W Category    Language
0  5.5 2024-03-28  10.0  7    apple  JavaScript
1  5.5 2024-03-28  20.0  7   banana  JavaScript
2  5.5 2024-03-28  30.0  7    apple  JavaScript
3  5.5 2024-03-28  40.0  7   banana  JavaScript

In [4]:
dataframe2.dtypes

X                 float64
Y           datetime64[s]
Z                 float32
W                   int32
Category         category
Language           object
dtype: object

## 13.10 Why, When and Where DataFrames is used?

**Why?**

* Dataframes manipulate the data very easily
* Used for slecting and replacing the columns of dataset to reshape the data

**WHen?**

* When you need to store data in the form to grids thats can be easily readable
* When the size of data is large and stored in the form of grides for analysis

**Where?**

* Mostly used in Data science
* Used in Machine learning algorithms for data analysis
* Used in Prediction systems

## 14. Viewing Data
* There are several ways to view the data:
* we can display the top rows of the dataset
* we can display the buttom rows of the dataset
* **[]** used for selection , which slices the rows
* Selection of multi-axis by using label
* Show the slicing of a label which includes the both endpoints
* Explicitly slice the rows
* Explicitly slice the columns
* Explicitly get the value
* Quick access to the scalr data
* Values are selected based oon the boolean condition.
* **isin()** method is used for filtering

**Example**

* Display the top 5 records by using **Head()** function

In [ ]:
dataframe.head()

                   A         B         C         D
2019-01-01  0.750605 -0.069523 -0.998938 -0.362319
2019-01-02 -0.346780  1.159567 -1.323603 -0.181600
2019-01-03  0.857102  0.662322 -0.955811  0.866493
2019-01-04 -0.634592 -1.675086 -0.350006  1.240305
2019-01-05 -1.103729 -0.123992 -0.151002 -1.066669

**Example**

* Display the buttom 5 records by using **tail()** method

In [ ]:
dataframe.tail(5)

                   A         B         C         D
2019-01-02 -0.346780  1.159567 -1.323603 -0.181600
2019-01-03  0.857102  0.662322 -0.955811  0.866493
2019-01-04 -0.634592 -1.675086 -0.350006  1.240305
2019-01-05 -1.103729 -0.123992 -0.151002 -1.066669
2019-01-06 -0.092746 -0.536141 -0.094074 -0.544467

**Example**

* The following example display the indexes

In [ ]:
dataframe.index

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06'],
              dtype='datetime64[ns]', freq='D')

**Example**

* The following example display the coloumns

In [ ]:
dataframe.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

**Example**

* The following example print the values of dataframes

In [ ]:
dataframe.values

array([[ 0.75060537, -0.06952336, -0.99893784, -0.36231859],
       [-0.34677959,  1.15956682, -1.32360278, -0.18160005],
       [ 0.85710224,  0.66232203, -0.95581069,  0.86649269],
       [-0.63459246, -1.67508622, -0.35000596,  1.24030452],
       [-1.10372937, -0.12399246, -0.15100209, -1.06666915],
       [-0.09274615, -0.53614127, -0.09407402, -0.54446735]])

**Example**

*  Transposing the given data

In [ ]:
dataframe.T

   2019-01-01  2019-01-02  2019-01-03  2019-01-04  2019-01-05  2019-01-06
A    0.750605   -0.346780    0.857102   -0.634592   -1.103729   -0.092746
B   -0.069523    1.159567    0.662322   -1.675086   -0.123992   -0.536141
C   -0.998938   -1.323603   -0.955811   -0.350006   -0.151002   -0.094074
D   -0.362319   -0.181600    0.866493    1.240305   -1.066669   -0.544467

**Example**

*  The following example shows, the sorting of data base on axis

In [ ]:
dataframe.sort_index(axis=1, ascending=False)

                   D         C         B         A
2019-01-01 -0.362319 -0.998938 -0.069523  0.750605
2019-01-02 -0.181600 -1.323603  1.159567 -0.346780
2019-01-03  0.866493 -0.955811  0.662322  0.857102
2019-01-04  1.240305 -0.350006 -1.675086 -0.634592
2019-01-05 -1.066669 -0.151002 -0.123992 -1.103729
2019-01-06 -0.544467 -0.094074 -0.536141 -0.092746

**Example**

*  The following example shows, the sorting of data values on **'B'**

In [ ]:
dataframe.sort_values(by='B')

                   A         B         C         D
2019-01-04 -0.634592 -1.675086 -0.350006  1.240305
2019-01-06 -0.092746 -0.536141 -0.094074 -0.544467
2019-01-05 -1.103729 -0.123992 -0.151002 -1.066669
2019-01-01  0.750605 -0.069523 -0.998938 -0.362319
2019-01-03  0.857102  0.662322 -0.955811  0.866493
2019-01-02 -0.346780  1.159567 -1.323603 -0.181600

**Example**

*  The following example shows, statistical summary of your data

In [ ]:
dataframe.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.095023 -0.097142 -0.645572 -0.008043
std    0.773775  0.983892  0.513215  0.881732
min   -1.103729 -1.675086 -1.323603 -1.066669
25%   -0.562639 -0.433104 -0.988156 -0.498930
50%   -0.219763 -0.096758 -0.652908 -0.271959
75%    0.539767  0.479361 -0.200753  0.604470
max    0.857102  1.159567 -0.094074  1.240305

**Example**

*  The following example shows, single column selection, which carry series, which is equivant to dataframe **A**

In [ ]:
dataframe['A']

2019-01-01    0.750605
2019-01-02   -0.346780
2019-01-03    0.857102
2019-01-04   -0.634592
2019-01-05   -1.103729
2019-01-06   -0.092746
Freq: D, Name: A, dtype: float64

**Example**

*  The following example shows, Select the data by using **[]**, That can slices the rows and return the range of rows

In [ ]:
dataframe[0:5]

                   A         B         C         D
2019-01-01  0.750605 -0.069523 -0.998938 -0.362319
2019-01-02 -0.346780  1.159567 -1.323603 -0.181600
2019-01-03  0.857102  0.662322 -0.955811  0.866493
2019-01-04 -0.634592 -1.675086 -0.350006  1.240305
2019-01-05 -1.103729 -0.123992 -0.151002 -1.066669

In [ ]:
dataframe['20190102':'20190105']

                   A         B         C         D
2019-01-02 -0.346780  1.159567 -1.323603 -0.181600
2019-01-03  0.857102  0.662322 -0.955811  0.866493
2019-01-04 -0.634592 -1.675086 -0.350006  1.240305
2019-01-05 -1.103729 -0.123992 -0.151002 -1.066669

**_Example_**

* In the following example Selection of multi-axis labeling data

In [ ]:
dataframe.loc[:,['A','B']]

                   A         B
2019-01-01  0.750605 -0.069523
2019-01-02 -0.346780  1.159567
2019-01-03  0.857102  0.662322
2019-01-04 -0.634592 -1.675086
2019-01-05 -1.103729 -0.123992
2019-01-06 -0.092746 -0.536141

**_Example_**
* This example will show the label slicing
* Both endpoints are included in this slicing

In [ ]:
dataframe.loc['20190102':'20190105',['A','B']]

                   A         B
2019-01-02 -0.346780  1.159567
2019-01-03  0.857102  0.662322
2019-01-04 -0.634592 -1.675086
2019-01-05 -1.103729 -0.123992

**_Example_**
* This example will shows the, that reduce the dimenssion

In [ ]:
dataframe.loc['20190102',['A','B']]

A   -0.346780
B    1.159567
Name: 2019-01-02 00:00:00, dtype: float64

**_Example_**
* This example will shows the how to get the scalar value

In [ ]:
dataframe.loc[date_time[0],'A']

0.7506053662559853

**_Example_**
* This example will shows the quick access to the scalar value

In [ ]:
dataframe.at[date_time[0],'A']

0.7506053662559853

**_Example_**
* This example will shows the quick access to the scalar value using position of passed value(integer)

In [ ]:
dataframe.iloc[4]

A   -1.103729
B   -0.123992
C   -0.151002
D   -1.066669
Name: 2019-01-05 00:00:00, dtype: float64

**_Example_**
* This example will shows the slices by integer
* Its just similar to numpy in python

In [ ]:
dataframe.iloc[3:5,0:2]

                   A         B
2019-01-04 -0.634592 -1.675086
2019-01-05 -1.103729 -0.123992

**_Example_**
* This example will shows the lists of integer locations,
* Its just similar to numpy in python

In [ ]:
dataframe.iloc[[1,2,4],[0,2]]

                   A         C
2019-01-02 -0.346780 -1.323603
2019-01-03  0.857102 -0.955811
2019-01-05 -1.103729 -0.151002

**_Example_**
* Explicit slicing of data shows in example given below

In [ ]:
dataframe.iloc[:,1:3]

                   B         C
2019-01-01 -0.069523 -0.998938
2019-01-02  1.159567 -1.323603
2019-01-03  0.662322 -0.955811
2019-01-04 -1.675086 -0.350006
2019-01-05 -0.123992 -0.151002
2019-01-06 -0.536141 -0.094074

**_Example_**
* This example will show the get the value from dataframe explicitly

In [ ]:
dataframe.iloc[1,1]

1.1595668190221116

**_Example_**
* This example will show the selection of data by using single column values

In [ ]:
dataframe[dataframe.B > 0]

                   A         B         C         D
2019-01-02 -0.346780  1.159567 -1.323603 -0.181600
2019-01-03  0.857102  0.662322 -0.955811  0.866493

**_Example_**
* This example will show the selection of data from Dataframe where boolean condition is satisfied

In [ ]:
dataframe[dataframe > 0]

                   A         B   C         D
2019-01-01  0.750605       NaN NaN       NaN
2019-01-02       NaN  1.159567 NaN       NaN
2019-01-03  0.857102  0.662322 NaN  0.866493
2019-01-04       NaN       NaN NaN  1.240305
2019-01-05       NaN       NaN NaN       NaN
2019-01-06       NaN       NaN NaN       NaN

**_Example_**
* This example will show **isin()** function for filtering

In [ ]:
dataframe2 = dataframe.copy()

In [ ]:
dataframe2['E'] = ['one', 'one','two','three','four','three']

In [ ]:
print(dataframe2)

                   A         B         C         D      E
2019-01-01  0.750605 -0.069523 -0.998938 -0.362319    one
2019-01-02 -0.346780  1.159567 -1.323603 -0.181600    one
2019-01-03  0.857102  0.662322 -0.955811  0.866493    two
2019-01-04 -0.634592 -1.675086 -0.350006  1.240305  three
2019-01-05 -1.103729 -0.123992 -0.151002 -1.066669   four
2019-01-06 -0.092746 -0.536141 -0.094074 -0.544467  three

In [ ]:
dataframe2[dataframe2['E'].isin(['two','four'])]

                   A         B         C         D     E
2019-01-03  0.857102  0.662322 -0.955811  0.866493   two
2019-01-05 -1.103729 -0.123992 -0.151002 -1.066669  four

In [ ]:
## Example 
df=pd.read_csv("My_dataset.csv")

In [17]:
df

,text,selected_text,sentiment
0,"I`d have responded, if I were going","I`d have responded, if I were going",neutral
1,Sooo SAD I will miss you here in San Diego!!!,Sooo SAD,negative
2,my boss is bullying me...,bullying me,negative
3,what interview! leave me alone,leave me alone,negative
4,"Sons of ****, why couldn`t they put them on t...","Sons of ****,",negative
...,...,...,...
27476,wish we could come see u on Denver husband l...,d lost,negative
27477,I`ve wondered about rake to. The client has ...,", don`t force",negative
27478,Yay good for both of you. Enjoy the break - y...,Yay good for both of you.,positive
27479,But it was worth it ****.,But it was worth it ****.,positive
27480,All this flirting going on - The ATG smiles...,All this flirting going on - The ATG smiles. Y...,neutral

In [18]:
df.head()

,text,selected_text,sentiment
0,"I`d have responded, if I were going","I`d have responded, if I were going",neutral
1,Sooo SAD I will miss you here in San Diego!!!,Sooo SAD,negative
2,my boss is bullying me...,bullying me,negative
3,what interview! leave me alone,leave me alone,negative
4,"Sons of ****, why couldn`t they put them on t...","Sons of ****,",negative

In [19]:
df.tail()

,text,selected_text,sentiment
27476,wish we could come see u on Denver husband l...,d lost,negative
27477,I`ve wondered about rake to. The client has ...,", don`t force",negative
27478,Yay good for both of you. Enjoy the break - y...,Yay good for both of you.,positive
27479,But it was worth it ****.,But it was worth it ****.,positive
27480,All this flirting going on - The ATG smiles...,All this flirting going on - The ATG smiles. Y...,neutral

In [21]:
df.index

RangeIndex(start=0, stop=27481, step=1)

In [22]:
df.columns

Index(['text', 'selected_text', 'sentiment'], dtype='object')

In [23]:
df.T

,0,1,2,3,4,5,6,7,8,9,...,27471,27472,27473,27474,27475,27476,27477,27478,27479,27480
text,"I`d have responded, if I were going",Sooo SAD I will miss you here in San Diego!!!,my boss is bullying me...,what interview! leave me alone,"Sons of ****, why couldn`t they put them on t...",http://www.dothebouncy.com/smf - some shameles...,2am feedings for the baby are fun when he is a...,Soooo high,Both of you,Journey!? Wow... u just became cooler. hehe....,...,"i`m defying gravity. and nobody in alll of oz,...",http://twitpic.com/663vr - Wanted to visit the...,in spoke to you yesterday and u didnt respond...,So I get up early and I feel good about the da...,enjoy ur night,wish we could come see u on Denver husband l...,I`ve wondered about rake to. The client has ...,Yay good for both of you. Enjoy the break - y...,But it was worth it ****.,All this flirting going on - The ATG smiles...
selected_text,"I`d have responded, if I were going",Sooo SAD,bullying me,leave me alone,"Sons of ****,",http://www.dothebouncy.com/smf - some shameles...,fun,Soooo high,Both of you,Wow... u just became cooler.,...,"i`m defying gravity. and nobody in alll of oz,...",were too late,in spoke to you yesterday and u didnt respond ...,I feel good ab,enjoy,d lost,", don`t force",Yay good for both of you.,But it was worth it ****.,All this flirting going on - The ATG smiles. Y...
sentiment,neutral,negative,negative,negative,negative,neutral,positive,neutral,neutral,positive,...,neutral,negative,neutral,positive,positive,negative,negative,positive,positive,neutral

In [25]:
df.sort_index(axis=1)

,selected_text,sentiment,text
0,"I`d have responded, if I were going",neutral,"I`d have responded, if I were going"
1,Sooo SAD,negative,Sooo SAD I will miss you here in San Diego!!!
2,bullying me,negative,my boss is bullying me...
3,leave me alone,negative,what interview! leave me alone
4,"Sons of ****,",negative,"Sons of ****, why couldn`t they put them on t..."
...,...,...,...
27476,d lost,negative,wish we could come see u on Denver husband l...
27477,", don`t force",negative,I`ve wondered about rake to. The client has ...
27478,Yay good for both of you.,positive,Yay good for both of you. Enjoy the break - y...
27479,But it was worth it ****.,positive,But it was worth it ****.
27480,All this flirting going on - The ATG smiles. Y...,neutral,All this flirting going on - The ATG smiles...

In [26]:
df.describe()

,text,selected_text,sentiment
count,27480,27480,27481
unique,27480,22430,3
top,All this flirting going on - The ATG smiles...,good,neutral
freq,1,199,11118

In [28]:
df['selected_text']

0                      I`d have responded, if I were going
1                                                 Sooo SAD
2                                              bullying me
3                                           leave me alone
4                                            Sons of ****,
                               ...
27476                                               d lost
27477                                        , don`t force
27478                            Yay good for both of you.
27479                           But it was worth it  ****.
27480    All this flirting going on - The ATG smiles. Y...
Name: selected_text, Length: 27481, dtype: object

In [29]:
df['sentiment']

0         neutral
1        negative
2        negative
3        negative
4        negative
           ...
27476    negative
27477    negative
27478    positive
27479    positive
27480     neutral
Name: sentiment, Length: 27481, dtype: object

In [30]:
df[0:5]

,text,selected_text,sentiment
0,"I`d have responded, if I were going","I`d have responded, if I were going",neutral
1,Sooo SAD I will miss you here in San Diego!!!,Sooo SAD,negative
2,my boss is bullying me...,bullying me,negative
3,what interview! leave me alone,leave me alone,negative
4,"Sons of ****, why couldn`t they put them on t...","Sons of ****,",negative

In [32]:
df.loc[:"selected_text","sentiment"]

0         neutral
1        negative
2        negative
3        negative
4        negative
           ...
27476    negative
27477    negative
27478    positive
27479    positive
27480     neutral
Name: sentiment, Length: 27481, dtype: object

In [33]:
df.iloc[5]

text             http://www.dothebouncy.com/smf - some shameles...
selected_text    http://www.dothebouncy.com/smf - some shameles...
sentiment                                                  neutral
Name: 5, dtype: object

In [34]:
df.iloc[[2,4,5]]

,text,selected_text,sentiment
2,my boss is bullying me...,bullying me,negative
4,"Sons of ****, why couldn`t they put them on t...","Sons of ****,",negative
5,http://www.dothebouncy.com/smf - some shameles...,http://www.dothebouncy.com/smf - some shameles...,neutral

In [37]:
df.iloc[0:4,3:5]

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3]

In [39]:
df2=df.copy()

In [40]:
df2

,text,selected_text,sentiment
0,"I`d have responded, if I were going","I`d have responded, if I were going",neutral
1,Sooo SAD I will miss you here in San Diego!!!,Sooo SAD,negative
2,my boss is bullying me...,bullying me,negative
3,what interview! leave me alone,leave me alone,negative
4,"Sons of ****, why couldn`t they put them on t...","Sons of ****,",negative
...,...,...,...
27476,wish we could come see u on Denver husband l...,d lost,negative
27477,I`ve wondered about rake to. The client has ...,", don`t force",negative
27478,Yay good for both of you. Enjoy the break - y...,Yay good for both of you.,positive
27479,But it was worth it ****.,But it was worth it ****.,positive
27480,All this flirting going on - The ATG smiles...,All this flirting going on - The ATG smiles. Y...,neutral

In [16]:
data_frame=pd.read_csv("data_set.csv")

In [17]:
data_frame

,Year,Industry_aggregation_NZSIOC,Industry_code_NZSIOC,Industry_name_NZSIOC,Units,Variable_code,Variable_name,Variable_category,Value,Industry_code_ANZSIC06
0,2023,Level 1,99999,All industries,Dollars (millions),H01,Total income,Financial performance,930995,ANZSIC06 divisions A-S (excluding classes K633...
1,2023,Level 1,99999,All industries,Dollars (millions),H04,"Sales, government funding, grants and subsidies",Financial performance,821630,ANZSIC06 divisions A-S (excluding classes K633...
2,2023,Level 1,99999,All industries,Dollars (millions),H05,"Interest, dividends and donations",Financial performance,84354,ANZSIC06 divisions A-S (excluding classes K633...
3,2023,Level 1,99999,All industries,Dollars (millions),H07,Non-operating income,Financial performance,25010,ANZSIC06 divisions A-S (excluding classes K633...
4,2023,Level 1,99999,All industries,Dollars (millions),H08,Total expenditure,Financial performance,832964,ANZSIC06 divisions A-S (excluding classes K633...
...,...,...,...,...,...,...,...,...,...,...
50980,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H37,Quick ratio,Financial ratios,52,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
50981,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H38,Margin on sales of goods for resale,Financial ratios,40,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
50982,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H39,Return on equity,Financial ratios,12,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
50983,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H40,Return on total assets,Financial ratios,5,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."
50984,2013,Level 3,ZZ11,Food product manufacturing,Percentage,H41,Liabilities structure,Financial ratios,46,"ANZSIC06 groups C111, C112, C113, C114, C115, ..."

In [18]:
data_frame.describe()

               Year
count  50985.000000
mean    2018.000000
std        3.162309
min     2013.000000
25%     2015.000000
50%     2018.000000
75%     2021.000000
max     2023.000000

In [19]:
data_frame.iloc[2,6]

'Interest, dividends and donations'